[
  {
    "id": "1lbl9tc",
    "title": "Israel urges US to join war with Iran to eliminate nuclear program",
    "text": "",
    "score": 16960,
    "num_comments": 2751,
    "created_utc": "2025-06-15 03:46:00",
    "url": "https://www.axios.com/2025/06/14/israel-iran-war-us-nuclear-program-trump"
  },
  {
    "id": "1ll26g8",
    "title": "Tehran Times claims leaked info shows Israel planned a US explosion to blame Iran and start a US-Iran war.",
    "text": "[**Tehran Times**](https://archive.is/9s1oI) — The plan involved orchestrating a destructive event within the U.S. and fabricating evidence to implicate Iran, thereby manipulating American public opinion and prompting military action.\n\nIran uncovered the Israeli plot through information shared by a friendly nation. Upon learning of the potential attack, Iranians sent messages to U.S. officials, and prevented the planned explosion from occurring.\n",
    "score": 4280,
    "num_comments": 630,
    "created_utc": "2025-06-26 19:53:30",
    "url": "https://i.redd.it/tsk0qum5ca9f1.jpeg"
  },
  {
    "id": "1ldc4no",
    "title": "AOC says she’s joining Republican Rep. Massie in prohibiting America's involvement in Israel’s war with Iran",
    "text": "",
    "score": 18974,
    "num_comments": 262,
    "created_utc": "2025-06-17 07:43:38",
    "url": "https://i.redd.it/m7ena1rlhe7f1.png"
  },
  {
    "id": "1lhaq4i",
    "title": "The US has officially entered into war with Iran",
    "text": "Bad day to be spawned in NA servers 😿",
    "score": 4369,
    "num_comments": 420,
    "created_utc": "2025-06-22 05:13:24",
    "url": "https://i.redd.it/qrflblnhfd8f1.jpeg"
  },
  {
    "id": "1lhjusv",
    "title": "Senator Mark Warner condemning Trump for starting an illegal war with Iran.",
    "text": "",
    "score": 2858,
    "num_comments": 365,
    "created_utc": "2025-06-22 14:26:18",
    "url": "https://i.redd.it/h0pj26s46g8f1.jpeg"
  },
  {
    "id": "1lffpfd",
    "title": "CMV: Israel’s attack on Iran was intended to draw the US into war, not prevent Iran from having a nuke",
    "text": "Israel claims its attack on Iran on Friday was about preventing Iran from obtaining nuclear weapons. I think that this is a pretty transparent lie for the reasons below.\n\nIsrael has been claiming Iran has been close to a nuclear weapon for 30 years. North Korea is significantly less advanced than Iran, but has successfully developed a nuke during that time period. \n\nIran previously had a nuclear weapon program. That ended in 2003 to avoid getting attacked by the US. Since then, it looks like it’s strategy has been to use its nuclear capability for deterrence. (“stop fucking with us; we can build a nuke pretty quickly”)\n\nIt is clear that Iran does not want a conflict with the United States. Openly weaponizing their nuclear program invites that conflict. \n\nOf course, they could pursue weaponization in secret. But the US, UK and Israel knowingly misrepresented evidence of WMD prior to the Iraq war. It is more than fair for the public to demand proof of weaponization since one party in this conflict has previously used this exact same lie as cover for regime change.\n\nIsrael does not have the ability to inflict significant damage to Iran’s nuclear program or pursue regime change in Iran on its own. Even if they had the capability to destroy Fordow, the enriched uranium is almost certainly spread out across the country. If Iran’s entire nuclear program including the uranium were destroyed, it could still develop a bomb in under 5 years.\n\nThe only ways to prevent Iran from obtaining a nuke is convincing the regime that a nuke is not in their best interest or changing the regime. \n\nIt’s still early, but it seems like Israel’s attack has made the idea of having a nuke more appealing to Iranians and the regime. It looks like having a nuke is the only way to deter Israel and its allies.\n\nSo why would Israel attack Iran? I think the most straightforward answer is they were hoping Iran would retaliate in a manner that forced the US to enter the conflict and pursue regime change.\n\nIran hasn’t taken the bait, so now Israel is attempting to present Iran as neutered by their campaign. “Iran is weak. Come over and help us finish the job”\n\nIran has been weakened, but they clearly have the capability to inflict more damage on Israel than they have demonstrated. The threat of offensive US involvement has constrained their response.\n\nOnce the US attacks, Iran will no longer be constrained by the threat of the US joining the conflict and will retaliate on US/ Israeli assets. The US will officially be in an offensive war that it did not initiate. This was Netanyahu’s actual calculation before Friday.\n\nMy view can be changed by concrete evidence of Iran’s nuclear weaponization and/or an explanation of how Israel thinks this bombing campaign will prevent Iran from pursuing a nuke without US involvement.\n\nTL;DR: Israel doesn’t have the capability to meaningfully impact Iran’s nuclear program or pursue regime change on its own. They attacked Iran hoping that they could provoke a strong response that would draw the US into the conflict. \n\nEdit: my view is not related to whether or not their attacks on Iran were justified or strategically sound. My view is the reason for attack was a lie. I don’t think Iran should have nuclear weapons. I just also don’t believe they were actively developing them.",
    "score": 1468,
    "num_comments": 1173,
    "created_utc": "2025-06-19 21:50:29",
    "url": "https://www.reddit.com/r/changemyview/comments/1lffpfd/cmv_israels_attack_on_iran_was_intended_to_draw/"
  },
  {
    "id": "17w2kf8",
    "title": "Iran tells Hamas it will not enter the war with Israel",
    "text": "",
    "score": 20086,
    "num_comments": 2141,
    "created_utc": "2023-11-16 01:14:07",
    "url": "https://www.yahoo.com/news/iran-tells-hamas-not-enter-190351808.html"
  },
  {
    "id": "1ld9zuf",
    "title": "President Trump abruptly cut short his meeting at G7 and is on his way back. White House added due to circumstances in the Middle East and Trump will be in the Security Room meeting the Chiefs. Our Tankers and air craft carrier is also on its way. Are we about to enter into a direct war with Iran?",
    "text": "Trump additionally noted via tweet for all Iranians to leave Tehran \\[Capital of Iran\\], warning that he had earlier stated for Iran to make a deal. \n\nPress secretary Karoline Leavitt, in a [post on X](https://x.com/presssec/status/1934755141082861736?s=46&t=M9mt1Xfq58yAZ64nK8b2qw), said that “much was accomplished” during Trump’s meetings on Monday with other leaders at the summit in Canada. But, she continued, “because of what’s going on in the Middle East, President Trump will be leaving tonight after dinner with Heads of State.”\n\nThe change of plans only added to the sense of uncertainty around Israel’s ongoing military operation in Iran, which Trump seemed to warn was about to intensify in an ominous and somewhat cryptic social media post after a day of meeting with world leaders.\n\nAre we about to enter into a direct war with Iran?\n\n[https://www.nytimes.com/live/2025/06/16/us/trump-news](https://www.nytimes.com/live/2025/06/16/us/trump-news)",
    "score": 1698,
    "num_comments": 442,
    "created_utc": "2025-06-17 05:57:39",
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ld9zuf/president_trump_abruptly_cut_short_his_meeting_at/"
  },
  {
    "id": "1lb3ja5",
    "title": "Inter: war with Israel strands Taremi in Iran. He was supposed to join his teammates today in California by flying out of Tehran",
    "text": "As Inter prepare for the Club World Cup, there are those who have reasons to smile again—like Lautaro, surprisingly back to training today at UCLA—and those going through moments of terrible anguish, like his people: Mehdi Taremi’s Iran is in open conflict with Israel, and the Iranian striker has been unable to leave for the U.S. to join the team’s training camp. His flight from Tehran was scheduled to depart for California today, and Mehdi showed up at the airport as planned—only to be forced to return home due to security concerns. The civilian airport was shut down amid the emergency.\n\nAs the war escalates and bombings continue on both sides, the entire airspace has been closed. Inter remain in constant contact with Taremi, and in the coming hours will try to find a way to get him out—though it won’t be easy under the current circumstances. Even though the Iranian forward is eager to reunite with his teammates, there are security concerns that far outweigh any football tournament.",
    "score": 2378,
    "num_comments": 256,
    "created_utc": "2025-06-14 13:11:52",
    "url": "https://www.gazzetta.it/calcio/coppa-mondo-club/14-06-2025/taremi-bloccato-in-iran-non-riesce-a-raggiungere-l-inter-negli-usa.shtml"
  },
  {
    "id": "1lgfttd",
    "title": "sick fucks Amb. Mike Huckabee and Sen. Ted Cruz Using Bible as pretext for war with Iran",
    "text": "Ted Cruz in interview with Tucker Carlsen quotes something about defending Israel is in the bible. \n\nwe're fucked.",
    "score": 3377,
    "num_comments": 140,
    "created_utc": "2025-06-21 02:38:02",
    "url": "https://www.yahoo.com/news/terrifying-expletive-trump-shares-text-161751810.html"
  },
  {
    "id": "1lhatj7",
    "title": "U.S. Enters War With Iran, Bombing Key Nuclear Sites",
    "text": "",
    "score": 2737,
    "num_comments": 132,
    "created_utc": "2025-06-22 05:18:11",
    "url": "https://i.redd.it/esiunm0bgd8f1.png"
  },
  {
    "id": "1lhuid4",
    "title": "'If Khamenei stops the fire, we'll accept that': Israel signals readiness to end war with Iran",
    "text": "",
    "score": 858,
    "num_comments": 460,
    "created_utc": "2025-06-22 23:11:32",
    "url": "https://www.ynetnews.com/article/rkgin2bege#autoplay"
  },
  {
    "id": "1fsfh5l",
    "title": "Israel now at war with three countries, asks the US to step in as \"a deterrent\"",
    "text": "Israel is wrecking Yemen, Lebanon, Palestine:\nhttps://www.timesofisrael.com/israel-strikes-port-power-plants-in-yemen-after-recent-houthi-missile-attacks/\n\nhttps://www.aljazeera.com/news/liveblog/2024/9/29/israel-attacks-lebanon-live-non-stop-bombardment-as-hezbollah-mourns-chief\n\nIsrael has asked the US to get involved and \"deter Iran\": https://www.axios.com/2024/09/28/iran-attack-israel-nasrallah-killing\n\nThousands of refugees are pouring into neighboring countries: https://www.reuters.com/world/middle-east/over-30000-crossed-into-syria-lebanon-past-days-says-un-2024-09-27/\n\nSince Israel is involved on several fronts, is it likely the US will listen to them and step in to a greater extent than it already has?\n\nAlso, what is the likelihood they will annex and settle parts of Lebanon? For example, here is one of their prominent spiritual figures calling Lebanon \"gods gift\" and to \"conquer and settle it\": https://m.jpost.com/israel-hamas-war/article-821752\n\nDoes Epstein's links to their Intel agency make US politicians more likely to give in to their demands since the blackmail system associated with Epstein would still be present? https://www.timesofisrael.com/for-writer-who-broke-epstein-case-a-rumored-mossad-link-is-worth-digging-into/\n\nWhat role does AIPAC play in all of this? A congressman recently remarked that almost everyone in Congress has an \"AIPAC babysitter\" who they consult frequently to ensure they're in line with AIPAC's policies: https://www.youtube.com/watch?v=74ZA-GdeQP4\n\nIs that merely a lobbyist? Or more similar to China's CCP government \"minders\" that ensure CCP party members stay in line?\n\nWhy were these five guys, some later found to be connected to their Intel agency, seen filming and cheering during a pivotal day in 2001?: https://www.heraldscotland.com/news/12768362.five-israelis-were-seen-filming-as-jet-liners-ploughed-into-the-twin-towers-on-september-11-2001/\n\nHow was there advanced knowledge beforehand?? https://www.haaretz.com/2001-09-26/ty-article/odigo-says-workers-were-warned-of-attack/0000017f-dbc4-df62-a9ff-dfd7beff0000\n",
    "score": 1501,
    "num_comments": 1126,
    "created_utc": "2024-09-30 02:37:49",
    "url": "https://www.reddit.com/r/PrepperIntel/comments/1fsfh5l/israel_now_at_war_with_three_countries_asks_the/"
  },
  {
    "id": "1le4izy",
    "title": "(Real) Mango Mussolini is about to drag us into Israel’s war with Iran and Charlie continues to be a good little cuck.",
    "text": "",
    "score": 2304,
    "num_comments": 132,
    "created_utc": "2025-06-18 06:19:18",
    "url": "https://i.redd.it/h5jc3yol7l7f1.jpeg"
  },
  {
    "id": "1lblykk",
    "title": "Hila Klein of H3H3 calls the pilot who participated in the attack on Iran a \"hero.\" Apologizes after her own fans take issue with her glorifying the violence and destruction caused by Israel",
    "text": "",
    "score": 1377,
    "num_comments": 222,
    "created_utc": "2025-06-15 04:18:36",
    "url": "https://www.reddit.com/gallery/1lblykk"
  },
  {
    "id": "1lhl031",
    "title": "America joined Israel’s war with Iran — and Trump is surrounded by a confederacy of dunces. Try to imagine Pete Hegseth and Tulsi Gabbard as Cabinet members advising the president through something like the Cuban Missile Crisis.",
    "text": "",
    "score": 2755,
    "num_comments": 104,
    "created_utc": "2025-06-22 15:45:22",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-iran-israel-war-hegseth-gabbard-loomer-bannon-rcna214170"
  },
  {
    "id": "1lsuo1y",
    "title": "Ayatollah Khamenei’s first public appearance since Iran’s war with Israel",
    "text": "",
    "score": 481,
    "num_comments": 790,
    "created_utc": "2025-07-06 11:38:32",
    "url": "https://v.redd.it/6wxib7sx87bf1"
  },
  {
    "id": "1enym5m",
    "title": "Iran’s new president battles revolutionary guard to stop all-out war with Israel",
    "text": "",
    "score": 2930,
    "num_comments": 263,
    "created_utc": "2024-08-09 17:38:05",
    "url": "https://www.telegraph.co.uk/world-news/2024/08/09/iran-president-masoud-pezeshkian-israel-revolutionary-guard/"
  },
  {
    "id": "1k7uly8",
    "title": "Trump: Israel won’t drag us into war with Iran, but we’ll lead the pack if no deal made",
    "text": "",
    "score": 901,
    "num_comments": 294,
    "created_utc": "2025-04-26 01:11:15",
    "url": "https://www.timesofisrael.com/trump-israel-wont-drag-us-into-war-with-iran-but-well-lead-the-pack-if-no-deal-made/"
  },
  {
    "id": "1lbvnj6",
    "title": "So, Indians just made Israel update a map in the middle of a war because they weren’t happy with the borders shown in the illustration. The region of Jammu & Kashmir was NOT depicted as part of India. Some of the comments were absolutely wild, lol…",
    "text": "",
    "score": 817,
    "num_comments": 242,
    "created_utc": "2025-06-15 13:43:59",
    "url": "https://www.reddit.com/gallery/1lbvnj6"
  },
  {
    "id": "7oeycc",
    "title": "France accuses U.S., Israel and Saudi Arabia of trying to spark war with Iran",
    "text": "",
    "score": 11220,
    "num_comments": 1702,
    "created_utc": "2018-01-06 03:38:46",
    "url": "http://www.newsweek.com/us-israel-saudi-arabia-leading-world-war-iran-france-says-770728"
  },
  {
    "id": "1jhfxeg",
    "title": "Boutta cop a t shirt with this on it before Trump will drag us into war with Iran because they have \"weapons of mass destruction\".",
    "text": "",
    "score": 1189,
    "num_comments": 164,
    "created_utc": "2025-03-23 00:03:33",
    "url": "https://i.redd.it/c0mk1ba9haqe1.jpeg"
  },
  {
    "id": "1leon5r",
    "title": "Bernie’s Take on War with Iran",
    "text": "",
    "score": 482,
    "num_comments": 236,
    "created_utc": "2025-06-18 23:27:33",
    "url": "https://i.redd.it/ek5zst61bq7f1.jpeg"
  },
  {
    "id": "1lg35sy",
    "title": "Iran’s internet blackout leaves public in dark and creates an uneven picture of the war with Israel",
    "text": "",
    "score": 562,
    "num_comments": 197,
    "created_utc": "2025-06-20 17:49:30",
    "url": "https://apnews.com/article/iran-internet-blackout-israel-war-6aa315eff871579f8bfc220ce3930e5f"
  },
  {
    "id": "198wn9r",
    "title": "My new prediction is now that Pakistan joins World War III on the side of Israel after India and Iran conspire to knock out its 3000 black jets",
    "text": "",
    "score": 2046,
    "num_comments": 254,
    "created_utc": "2024-01-17 18:33:37",
    "url": "https://i.redd.it/p8ybjp0c60dc1.png"
  },
  {
    "id": "1g9kdab",
    "title": "A Mideast Shift Is Underway, Without Israel • Before Hamas’s Oct. 7 attacks, Saudi Arabia was open to forging stronger ties with the Israelis. Now, a year into the war in Gaza, it is warming up to its traditional enemy, Iran.",
    "text": "A year ago, Saudi Arabia was preparing to recognize Israel in a normalization deal that would have fundamentally reshaped the Middle East and further isolated Iran and its allies while barely lifting a finger to advance Palestinian statehood.\n\nNow, that deal is further away than ever. Instead, Saudi Arabia is warming relations with its traditional archenemy, Iran, while insisting that any diplomatic pact now hinges on Israel’s acceptance of a Palestinian state.\n\nA diplomatic détente is underway in the Mideast, but not the one envisioned by the Israeli prime minister, Benjamin Netanyahu, who continues to say that his administration can clinch a deal with Riyadh. This month, the foreign ministers of the Persian Gulf states met for the first time as a group with their Iranian counterpart. It is a shaky, early-stage rapprochement that will only chip away at centuries of sectarian antagonisms, but it represents a sharp shift in a region where the rivalry between Riyadh and Tehran has drenched the region in bloodshed for decades.\n\nTehran’s outreach continued after that, with the Iranian foreign minister, Abbas Araghchi, visiting Saudi Arabia before heading to other countries in the region, including Iraq and Oman, in an effort to ease tensions. He also visited Jordan before traveling to Egypt and Turkey. The visit to Egypt was the first by an Iranian foreign minister in 12 years.\n\nWhat changed? Images started streaming out of Gaza of children buried alive under rubble, mothers grieving over their dead babies and Palestinians starving because Israel had blocked aid from entering the territory — all of which made it impossible for the Saudi leadership to ignore the issue of Palestinian statehood.\n\n[Read a copy of the rest of the article here](https://archive.is/DYldd)",
    "score": 577,
    "num_comments": 558,
    "created_utc": "2024-10-22 20:06:09",
    "url": "https://www.nytimes.com/2024/10/20/world/middleeast/israel-saudi-arabia-iran-gulf.html"
  },
  {
    "id": "1lh1dvg",
    "title": "Hakeem Jeffries recent statement regarding possible war with Iran",
    "text": "",
    "score": 362,
    "num_comments": 218,
    "created_utc": "2025-06-21 22:04:17",
    "url": "https://i.redd.it/dxiwa8ixab8f1.jpeg"
  },
  {
    "id": "1ftpodm",
    "title": "It looks more certain that Joe Biden has dragged us into a war with Iran",
    "text": "Article:\n\nhttps://www.cnn.com/world/live-news/israel-lebanon-war-hezbollah-10-1-24-intl-hnk/index.html",
    "score": 1141,
    "num_comments": 188,
    "created_utc": "2024-10-01 19:37:55",
    "url": "https://i.redd.it/bye4s2u2p5sd1.jpeg"
  },
  {
    "id": "1lekukf",
    "title": "FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK",
    "text": "I’m not American, I’m Canadian, but I swear on my life that if Canada gets involved somehow, I’m fleeing to the UK or somewhere. I’m scared as fuck right now. God help us all before this turns into world war 3. I fucking can’t with the 21st century anymore. ",
    "score": 27268,
    "num_comments": 5463,
    "created_utc": "2025-06-18 21:00:26",
    "url": "https://www.reddit.com/gallery/1lekukf"
  },
  {
    "id": "1leyeyy",
    "title": "Crowds marching through NYC with banner \"NO US-ISRAEL WAR ON IRAN\"",
    "text": "",
    "score": 2442,
    "num_comments": 27,
    "created_utc": "2025-06-19 06:30:24",
    "url": "https://v.redd.it/ogfhjc6ges7f1"
  },
  {
    "id": "1lhenmr",
    "title": "r/Conservative imploding after Donald \"No Wars\" Trump strikes Iran",
    "text": "[**Source**](https://www.reddit.com/r/Conservative/comments/1lhacy4/trump_announces_the_us_has_bombed_iran/)\n\n**Highlights:**\n\n**\"**[**Hope this doesn’t escalate into us putting boots on the ground**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2kvn4/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>That will NOT happen.**\n\n**>>You can't know that.**\n\n**>>>No I can't know it for sure. But that is my gut feeling and I'm going with it. Trump doesn't even want to do that.**\n\n**---**\n\n**\"**[**What happens now?**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2k9wl/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**> \"Same as before the strike but now Irans nuclear program is set back farther.\"**\n\n**>>“Same as before” meaning “far more retaliatory strikes on American personnel, as well as terror attacks against American civilian soft-targets?”**\n\n**Let’s not pretend like bombing a country’s key nuclear facility will have no downsides. We are in the war now. When they attack us back, we will become more and more involved.**\n\n**>>>We can't stop Iran from getting a nuke - there's no telling what those lunatic madmen will do in retaliation!**\n\n**This is exactly why we needed to stop them before they got a Nuke.**\n\n**>>>>They weren't actively building a nuclear weapon though. Just enriching uranium, still not to weapons grade though. And tulsi clarified that while enrichment was high, there was no active WMD program since it's ending in 2003. You do know there would be zero incentive for them to attack us without provocation, and really zero possibility, as they don't have ICBMs, right? They were negotiating (before Israel killed all the negotiators, and we bombed them) to get sanctions relief. But now that we attacked them, all bets are off. They have nothing else to really lose and the negotiations are over forever now. They have no leverage now for sanctions relief, and I doubt they will bend the knee and make peace.**\n\n**For decades, their stated reason for hating us is for arming, funding, and supporting Israel, their main rival in the region. A nuclear-capable rival, mind you. Also, for our support of Iraq in the Iran-Iraq war, which greatly hurt their position in the middle east. Oh yea, and backing the Shah all those years. Maybe if we butted out of their business and were more America-first, we wouldn't have as many problems with them.**\n\n**>>>>>We can't be sure of that. Depending on how they hide radiation emissions (such as deep within a mountain), they most certainly could have already reached weapons grade enrichment.**\n\n**Remember, we can't just fly a WC-135 over Iran. Even if we could, they could still hide it.**\n\n**>>>>>>Our intel agencies still assert there is no active weapons program, tulsi just said this, along with the caveat that their enrichment was high, but not weapons grade. IIRC, inspections were not so long ago.**\n\n**Sorry bro, but I got to trust the most resourceful intel agency to ever exist over \"we can't be sure\".**\n\n**---**\n\n**\"**[**So the 2 weeks were a distraction.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2mm6a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>\"Let's call it what it was... a lie.\"**\n\n**>>\"Wait...Trump lies?? 😱\"**\n\n**---**\n\n**\"**[**I'm not going to lie, I don't like it. I'm in the military, a handful of years left till retirement, and this doesn't sit very well. I'm hoping for the best, but I'm not getting warm fuzzies from it at all.  Edit: to the anon here that claimed I'm not in the military, eat shit. I don't owe anything to anyone. I've been doing my time for 15 years. You sit back and enjoy the comfort from your arm chair while I'm sent off to fight another war soon enough.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2l8pj/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>I don't mean to instigate, I'm just curious what you would have preferred? I'm of the opinion that Iran absolutely can not be allowed to have nuclear weapons, and they have proven any diplomatic option is untenable because they just ignore whatever treaty/deal you sign. What other option is there? Again, I am genuinely asking this conversationally.**\n\n**>>I would prefer not to be involved over there. Israel started the strikes, let them finish it. I'm sick and tired of being the world police. We bragged about no new wars under Trump's first term, and now we're ok with direct and targeted bombing of an adversary? I'm not ok with that. Look at their allies. This creates more tension in the region and with their allies; China and Russia. Yea, Russia is busy getting their asses handed to them by Ukraine, but China has been sitting back. What's stopping them from funding Iran? They already have aircraft going back and forth between them and Iran. Makes you think. What would I prefer? Not being in another \"conflict\" overseas. Not funding overseas wars in any capacity.**\n\n**>You prefer Iran going nuclear?**\n\n**>>Netanyahu has been saying since the 90s Iran is weeks away from a Nuke, 30 years later and it still hasn’t happened.**\n\n**We’re doing Israel’s bidding in the Middle East, per usual.**\n\n**---**\n\n**\"**[**We bombed them and now he said we have peace? Is this like the same thing as a peaceful protest?**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2k6xb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>no this is like the police restoring order after a riot. the police might use force to bring about peace.**\n\n**---**\n\n**\"**[**When did congress vote to go to war with Iran?**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2ot6x/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>Congress hasn’t voted to go to war since the 1940’s**\n\n**>>Congress has, however, authorized military actions since then. For example the first and second Iraq war, Afghanistan, and Syria. The President does not have unilateral power to offensively attack another nation, for good reasons.**\n\n**---**\n\n**\"**[**Iran is weaker than us but not so weak that they can’t harm us. This is an act of war and we can all make the equivocations all we want that it’s not boots on the ground or what have you but our military bombed their country’s government. That’s an act of war.  There’s no great plan of action from here and this is not our war.If we’re not in the sandbox it’s not our problem. Iran is a much bigger problem for Israel than us and we’ve allowed them to make this our problem. The idea that they’re just going to have peace talks after this is crazy.  Israel cannot occupy the country, they can’t force a regime change or hold territory in such a way to make Iran capitulate. This is a bombing run without a way to force them to stop afterwards. They can hold out, they can rebuild and they will hold a grudge. This is a half assed war that just further bogs us down in the ME.  Trump said no more wars, this is a war. We can defeat Shia militias, we can defeat their proxies but why the hell should we when we’ve got so many other problems all over? Why should even a few soldiers die for this cause? Resources we could deploy at home, elsewhere abroad and with far greater benefit to the United States.  Trump is not the anti-war president**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2xhgu/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**---**\n\n**\"**[**Trump, if you put boots on the ground, we're done with you.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2mqvh/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>I'm not even sure where this narrative is coming from. What gives you the impression we are putting boots on the ground? Did reddit tell you this was happening? Trump is being strategically vague because we don't want to telegraph to Iran that B2s are about to show up.**\n\n**---**\n\n**\"**[**Well, it's done then. We satisfied a limited target, and then exited. No \"Nation building,\" no \"Regime change.\" Leave all that to Israel. Just \"In & Out.\"**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2kfxy/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>right, israel has a great history of figuring out their own problems and not making us deal with it**\n\n**---**\n\n**\"**[**For all you brigaders/fellow conservatives out there about to do some pearl clutching, this does NOT mean war. It was a successful operation and no soldiers died.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2kq7j/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>Umm Iran is going to retaliate against us now. They will fire off missiles at our bases I'm sure.**\n\n**>In what world do you live in where a country performs an act of war on another country, and that country doesn't respond??????**\n\n**>We’ve got over 40,000 vulnerable troops in the region. God bless them. But you can bet that precious Israel will get the bulk of the protection.**\n\n**---**\n\n**\"**[**How was this constitutional? They never attacked the USA. If they did he wouldn’t need congress, since they didn’t, he would need an act of congress.  Well guess the democrats cant complain. They let Barry set the precedent for bombing countries without an act of war.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2lx91/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>Obama set the precedent? Really?**\n\n**Look, I** ***despise*** **Obama but no president has needed an act of congress to deploy troops or wage an extended intervention to Korea, Vietnam, Grenada, Panama, Iraq, Iraq Part 2, Afghanistan, Somalia, Yugoslavia, Haiti, Kosovo… You get the idea.**\n\n**---**\n\n**\"**[**The amount of bots that will be pushing narratives in the next few days will be astounding. Stay frosty**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2pkvg/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>There’s unreal astroturfing in here already**\n\n**Great move by Trump. Clear as day**\n\n**---**\n\n**\"**[**I was initially opposed to any US involvement at all, out of a somewhat irrational (or maybe not really) fear of an Iraq 2.0. This sounds like an almost one-and-done deal, and I can get behind it. I’m hoping for no further escalation. I still don’t trust that Iran was close to nukes… US intel seems imply they aren’t.**  ](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2li40/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**---**\n\n**\"**[**I was promised this wouldn’t happen.**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz2wnvj/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)**\"**\n\n**>You were promised unchecked nuclear proliferation in theocratic terroristic nations?**\n\n**>>Unless we put boots on the ground or we start engaging in a tit for tat slugfest, we aren't at war. I'm not a huge fan of bombing nations we aren't at war with, but at the same time, it's bombing nations we aren't at war with.** \n\n**Key phrase being, \"aren't at war with.\"** \n\n**He bombed the Houthis just a few weeks ago, are we at war with Yemen?** \n\n**>>>No but we are at war with the Houthis. They are a designated terrorist group and we are at war with them as much as you can be with a non-state actor**\n\n**When a government kills people in another country’s government building that’s an act of war. We can dress it up all we want and we’re desensitized to it by years and years of military action without a declaration of war but that is what war looks like.**\n\n**>>>>Uhm. No its not? This is called being confidently incorrect, folks.**\n\n**---**\n\n**!!! Edit !!!**\n\n[**They now have a stickied comment at the bottom of the linked post talking about how this sub is \"brigading\" because of this post (lol, lmao even)**](https://www.reddit.com/r/Conservative/comments/1lhacy4/comment/mz49jz4/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nEdit 2\n\n[I have received the befabled reddit care message, so they're REALLY heated now lol](https://imgur.com/a/befabled-reddit-care-message-gW6VTnW)",
    "score": 23871,
    "num_comments": 1994,
    "created_utc": "2025-06-22 08:48:23",
    "url": "https://www.reddit.com/r/SubredditDrama/comments/1lhenmr/rconservative_imploding_after_donald_no_wars/"
  },
  {
    "id": "1lhi3gu",
    "title": "Bernie Sanders: Trump Cannot Declare War on Iran Without Congress",
    "text": "During a speech in Tulsa, Bernie Sanders responded to a breaking tweet from Donald Trump declaring that the United States is at war with Iran and assisting Israel.\n\nSanders immediately called out the constitutional violation, stating plainly that war powers rest with Congress, not the president.\n\n> *\"The only entity that can take this country to war, is the US congress. The president does not have the right\" - Bernie Sanders*\n\n\nIf Trump’s declaration holds any executive weight, it bypasses the War Powers Resolution and sets a dangerous precedent.\n\n**Relevant Sources:**\n\n- War Powers Resolution of 1973 (GovInfo)\nhttps://www.govinfo.gov/content/pkg/STATUTE-87/pdf/STATUTE-87-Pg555.pdf\n\n\n- U.S. Constitution, Article I, Section 8\nhttps://constitution.congress.gov/browse/article-1/section-8/\n\n\n**TL;DR: Bernie Sanders calls Trump’s unilateral war declaration unconstitutional, asserting that only Congress can declare war under Article**",
    "score": 29404,
    "num_comments": 1434,
    "created_utc": "2025-06-22 12:24:35",
    "url": "https://v.redd.it/akg2hmvekf8f1"
  },
  {
    "id": "1lf5ugt",
    "title": "Iran's Hormuz Strait Closure: A Recipe for Global Economic Collapse?",
    "text": "",
    "score": 15594,
    "num_comments": 2254,
    "created_utc": "2025-06-19 13:44:16",
    "url": "https://i.redd.it/cw8ec6bwju7f1.jpeg"
  },
  {
    "id": "1leogpl",
    "title": "Texas Republican Calls on Trump to Go To War With Iran For Israel Because ‘It’s Biblical’",
    "text": "",
    "score": 301,
    "num_comments": 199,
    "created_utc": "2025-06-18 23:20:32",
    "url": "https://dailyboulder.com/texas-republican-calls-on-trump-to-go-to-war-with-iran-for-israel-because-its-biblical/"
  },
  {
    "id": "1la3gzv",
    "title": "We can't let Israel drag us into a war with Iran!",
    "text": "",
    "score": 1231,
    "num_comments": 51,
    "created_utc": "2025-06-13 06:17:08",
    "url": "https://i.redd.it/5eumze6nil6f1.jpeg"
  },
  {
    "id": "1770qyh",
    "title": "Saudi Arabia puts Israel deal on ice amid war, engages with Iran, sources say",
    "text": "",
    "score": 1467,
    "num_comments": 241,
    "created_utc": "2023-10-13 20:01:30",
    "url": "https://www.reuters.com/world/middle-east/saudi-arabia-puts-israel-deal-ice-amid-war-engages-with-iran-sources-say-2023-10-13/"
  },
  {
    "id": "1la4o7v",
    "title": "Please for the love of God don't let us get involved with Israel Iran!",
    "text": "I know these boomer fascists are wanting an excuse to start a war, I'm a Vet and I see so many parallels between the \"weapons of mass destruction\" like and the \"preemptive strike\" claims now. These are terrifying times even without looking deep into the allies of each country.",
    "score": 509,
    "num_comments": 118,
    "created_utc": "2025-06-13 07:18:44",
    "url": "https://www.reddit.com/r/BoomersBeingFools/comments/1la4o7v/please_for_the_love_of_god_dont_let_us_get/"
  },
  {
    "id": "1lile1x",
    "title": "No War With Iran Rally!",
    "text": "",
    "score": 179,
    "num_comments": 240,
    "created_utc": "2025-06-23 21:36:48",
    "url": "https://i.redd.it/5s63apcufp8f1.jpeg"
  },
  {
    "id": "1lbla52",
    "title": "Israel urges US to join war with Iran to eliminate nuclear program",
    "text": "",
    "score": 194,
    "num_comments": 237,
    "created_utc": "2025-06-15 03:46:25",
    "url": "https://www.axios.com/2025/06/14/israel-iran-war-us-nuclear-program-trump"
  },
  {
    "id": "1753mt5",
    "title": "Israel stated that this is their 9/11. So do they mean this is a false flag operation done by Israeli intelligence and military agencies to go to war with Iran.",
    "text": "",
    "score": 1791,
    "num_comments": 177,
    "created_utc": "2023-10-11 07:45:32",
    "url": "https://i.redd.it/2b5zvjpglhtb1.jpg"
  },
  {
    "id": "1fufrbe",
    "title": "Iran Is Not Ready for War With Israel",
    "text": "",
    "score": 580,
    "num_comments": 253,
    "created_utc": "2024-10-02 18:07:21",
    "url": "https://www.theatlantic.com/international/archive/2024/10/iran-israel-war-lebanon/680114/?utm_source=reddit&utm_medium=social&utm_campaign=the-atlantic&utm_content=edit-promo"
  },
  {
    "id": "1lbvwbo",
    "title": "Emergency Podcast on Israel/Iran War",
    "text": "The Prof G Podcast produced what the podcast called an “Emergency Episode” on Saturday, June 14 in which Scott Galloway invited Dan Senor, who is described by the podcast as “a leading expert on Israel and the Middle East”, to explain the recent fighting between Israel and Iran.\n\nDan Senor served as a foreign policy advisor to Mitt Romney in his 2012 presidential campaign.  Dan has been advocating for Israel to attack Iran’s nuclear facilities since that time.\n\nDan studied at Hebrew University in Jerusalem and his father worked for Israel Bonds, a U.S. underwriter of debt issued by the State of Israel.  Bonds issued by Israel and purchased by the American Jewish community were a key financial support for the state of Israel in times of crisis.\n\nSuffice to say, Dan Senor is strongly pro-Israel.  He describes people who protest in favor of human rights for Palestinians as “Hamas cheerleaders”.  I have never seen a Palestinian rights activist express even an ounce of enthusiasm for the actions of Hamas on October 7, but I would characterize Dan’s demeanor throughout the podcast episode as being giddy in talking about the “surprise” attack on Iran by Israel and comparing it to what he called the “spectacular” attack on Iran last October.  He comes across as a stronger cheerleader for war and escalation of violence than any campus protestor.\n\nIn describing Israel's aims for the attack.  Dan claims that Israel was successful in taking out the leadership and chain of command in the Israeli military necessary to launch missiles as a counter attack against Israel.  But this makes no sense really, since Iran did in fact launch a counter attack consisting of hundreds of missiles within hours.  \n\nThere is no doubt the U.S. had knowledge of the attack.  It was reported in the media days before the attack that the U.S. had ordered non-essential personnel out of Iraq due to the possibility of such an attack.  Dan also claims that the U.S. intentionally deceived Iran into thinking that no attack from Israel would occur before the 6th round of talks on an Iran nuclear agreement which was to take place on Sunday, June 16th. This is a startling accusation that would undermine any remaining credibility the U.S. negotiating team has and I am not sure what reason Iran would have for any further discussion with the Americans.\n\nDan goes on to paint his vision of Israel as a military Goliath that other nations, like Saudi Arabia will now want to partner with because everybody likes a winner.  This would be a shocking outcome to me given that Israel has become something more like a pariah state than at any time in their history.  To me this vision reveals Dan’s completely delusional view of the how the rest of the world perceives Israel in light of the human tragedy in Gaza.\n\nScott adds to this conversation by describing the great many very American-like Persian people he knows. And what great affinity they have for American culture, and if only there could be a regime change in Iran, America and Iran could have a close relationship.  Scott describes himself as a raging Zionist and Dan describes the far-right in America as being overwhelmingly supportive of Israel.  If only they could bring the Iranians around to this vision of world peace to help finish off the pesky Palestinian people occupying the last bit of land needed for the dream of greater Israel! \n\nI don’t think Scott has very many honest relationships with his Persian friends, because all of the Persians I know, and I know a lot, think the Zionist project is an evil and racist endeavor as does the rest of the Arab world.  \n\nIsrael’s air superiority over Iran is plain to see and Iran has no real defense.  Their only counter is to launch missiles and within days or weeks they will exhaust their arsenal.  We are not going to see a ground war between Israel and Iran.  Iran has a significant manpower advantage in a ground war, but distance between the countries is too great and Israel could never hold territory in Iran given the vastly greater population of Iran compared to Israel.   So this war will start and end with Israel  bombing Iran and the only questions are how long it will last, how much it will cost American taxpayers, and whether America will supply all of the bombs to make Tehran look like Gaza.\n\nTowards the end of the conversation, Dan reiterates his belief that violence was always the only option for dealing with Iran and that any attempt at diplomacy is misguided and naive.  When people like Dan Senor and Benjamin Netanyahu run the world, violence is the only option because it’s the only thing they believe in.\n\nWhile Dan claims that regime change is not the end goal but also that diplomacy is not a realistic approach for dealing with the Iranian leadership, then like Gaza, there is no end game.  Israel will just have to keep bombing Iran every time they get close to either a diplomatic agreement with America or building a nuclear weapon.   And from Iran’s perspective the only options are complete surrender or build a nuclear weapon as the only viable deterrent against further attacks.",
    "score": 64,
    "num_comments": 365,
    "created_utc": "2025-06-15 14:00:57",
    "url": "https://www.reddit.com/r/ScottGalloway/comments/1lbvwbo/emergency_podcast_on_israeliran_war/"
  },
  {
    "id": "1lawel1",
    "title": "Iran strikes back at Israel with missiles over Jerusalem, Tel Aviv",
    "text": "'[Israel] started this and triggered a war'\n\nBREAKING: Iran launched retaliatory airstrikes at Israel on Friday night, with explosions heard in Jerusalem and Tel Aviv, the country's two largest cities, following Israel's biggest-ever military strike against its longstanding enemy.\n\nIran's Supreme Leader Ayatollah Ali Khamenei also announced in a statement on Friday that Israel started a war and said it will not be allowed to do \"hit and run\" attacks without grave consequences.\n\n\"Life will become bitter for them, without a doubt. They should not think they struck and it’s over — no. They started this and triggered a war. We will not allow them to walk away unscathed from the great crime they have committed,\" he said.\n\n📷: Reuters\n\nRead more: https://www.gmanetwork.com/news/topstories/world/949366/iran-strikes-back-at-israel-with-missiles-over-jerusalem-tel-aviv/story/",
    "score": 202,
    "num_comments": 209,
    "created_utc": "2025-06-14 06:12:22",
    "url": "https://www.reddit.com/gallery/1lawel1"
  },
  {
    "id": "1gxxh4f",
    "title": "Brits will have to die defending Israel in war with Iran, says UK envoy to Tel-Aviv",
    "text": "",
    "score": 710,
    "num_comments": 154,
    "created_utc": "2024-11-23 16:19:46",
    "url": "https://www.middleeastmonitor.com/20241121-brits-will-have-to-die-defending-israel-in-war-with-iran-says-uk-envoy-to-tel-aviv/"
  },
  {
    "id": "3bd59t",
    "title": "ISIS terrorist leader ‘Caliphate’ officially declares war with Rome, India, China, Palestine (Israel), Somalia, Iran, Pakistan, Egypt, Iraq, Indonesia, Afghanistan, Tunisia, Libya, Algeria and Morocco.",
    "text": "",
    "score": 2277,
    "num_comments": 955,
    "created_utc": "2015-06-28 07:25:37",
    "url": "http://www.africametro.com/international-reports/terrorist-caliphate-declares-war-with-china-india-rome/"
  },
  {
    "id": "1lchxjy",
    "title": "I'm having some fucking ethical concerns with this Israel/Iran Situation",
    "text": "Obviously, I want to see Israel pay for what I perceive to be their crimes. I want to see Netanyahu pulled in front of the ICC in an orange jumpsuit, and him and his whole cabinet sentenced to death by public execution for their crimes. I am also aware that a large portion of the Israeli people have been complicit with his genocidal regime.\n\nHowever...\n\nThe \"ha ha, look at the scared Israeli's, I hope they all die\" rhetoric is fucking gross. And Im struggling because, yea, on several levels, I want to see them suffer for allowing a genocidal regime to cause atrocities. But, turning Tel Aviv into another Gaza (which ironically is a comparison an Israeli man made in a tweet), is just another atrocity. In a situation full of atrocities.\n\nThoughts?\n\nEDIT: Yes, I know Khamenei's theocratic regime also sucks, and I know we should also show consideration to the Persian people who are also dying as a result of Bibi's war lust. This isn't about picking sides, black and white, good guys or bad guys. My post was not intended to be a blanket statement of the whole conflict, with seven layers of clarification and nuance, but was instead directed at *us*, how we are reacting to the conflict, and how  being gleeful over *more* dead bodies, is ethically repugnant.",
    "score": 153,
    "num_comments": 213,
    "created_utc": "2025-06-16 07:42:46",
    "url": "https://www.reddit.com/r/chaoticgood/comments/1lchxjy/im_having_some_fucking_ethical_concerns_with_this/"
  },
  {
    "id": "1lh6221",
    "title": "Liberal commentator & AIPAC ally Van Jones promotes war with Iran under the guise of womens' rights, support for Israel, etc. - by running through the most common talking-points & gross generalizations",
    "text": "",
    "score": 462,
    "num_comments": 89,
    "created_utc": "2025-06-22 01:30:09",
    "url": "https://v.redd.it/dzp1fv8tac8f1"
  },
  {
    "id": "1jgzkb5",
    "title": "The Time Israel's Mossad Posed as the CIA in Pakistan and Tried to Ignite a War with Iran",
    "text": "",
    "score": 641,
    "num_comments": 98,
    "created_utc": "2025-03-22 08:35:46",
    "url": "https://youtu.be/3p_JDwuqwxQ?si=9wbASpYv0_PPSKFo"
  },
  {
    "id": "8ga8nm",
    "title": "Israel seems to be preparing for war with Iran, U.S. officials say",
    "text": "",
    "score": 1578,
    "num_comments": 931,
    "created_utc": "2018-05-01 22:30:14",
    "url": "https://www.nbcnews.com/news/mideast/israel-seems-be-preparing-war-iran-say-u-s-officials-n870051"
  },
  {
    "id": "1lcscyo",
    "title": "With No Clear Off-Ramp, Israel’s War With Iran May Last Weeks, Not Days",
    "text": "",
    "score": 156,
    "num_comments": 181,
    "created_utc": "2025-06-16 18:08:42",
    "url": "https://www.nytimes.com/2025/06/16/world/middleeast/iran-israel-war-off-ramp.html"
  },
  {
    "id": "1jo32s3",
    "title": "The Trump Administration is preparing for war against Iran on Israel's behalf to bring in the end times.",
    "text": "**Trump's Israel First Administration:**\n\nThe Trump Administration has been the most pro-Israel presidency in the history of the US. The America first movement has been infiltrated by Israeli agents so that the populace would vote to install Trump. They tricked you into thinking that Trump would bring back a second golden age by nativist/nationalist policies like mass deportations for illegals. The reality is that the only deportations that are happening are the pro-Palestine international students who criticised Israel, and some universities were stripped of their funding for not \"addressing antisemitism\".\n\nThat's just one of the many 'Israel First' moves they've done. Most of the GOP is AIPAC funded, his cabinet is for the large part jewish. Trump freezes aid to almost every country except for Israel, which is still receiving billions. There is a video of Trump pushing a chair in for Netanyahu in the White House, showing who's the owner and who's the pet. Not to mention that most of America's elite is jewish.\n\n**The reason why Israel wants Iran gone:**\n\nThe Greater Israel vision is to control the territory \"from the Nile to the Euphrates\" which was promised to them 3,000 years ago, and is the cornerstone to fulfilling the prophecy of the end times. This also coincides with the plans to rebuild the third temple of Solomon to fulfil the biblical prophecies of the apocalypse. US Sec of Defense Pete Hegseth floated the idea around, requiring the destruction of the Al-Aqsa mosque. The 'Greater Israel' vision seems to be adopted in Israel, some IDF soldiers were photographed wearing a patch depicting the expanded borders.\n\nThere is speculation that the state of Israel is the synagogue of Satan, and along with the bible prophecy which they would claim to be 'jews' but are not. Genetic testing in Israel is banned, so there isn't too much research on the genetic history of modern Israel, but prominent jewish leaders originally had European last names (Netanyahu's last name was switched from Mileikowsky), Ashkenazi jews are genetically European and 97.5% of them lack Hebrew DNA. Not to mention the Khazarian mass conversion to judaism which has been shrouded in mystery.\n\nthe Greater Israel plan and subsequent rebuilding of the Solomon temple would require the Arab states of Egypt, Libya, Jordan, Lebanon, Syria, Iraq, Saudi Arabia and Iran severely weakened or have submitted to Israel. So far, most states have toppled by revolutions and wars except Iran. Syria's Assad regime was toppled recently in Dec 2024 by Al-Qaeda, with the terrorist organisation being funded by Israel. Iran is the only state in the region standing that can resist jewish expansion, and Israel will not win a war against Iran.\n\nUS for the most part has no reason to be hostile with Iran. It is on the other side of the world and fighting a war would not benefit the US whatsoever. If Iran had nuclear weapons, it would not reach the US, it would only be in range of Israel.\n\n**Trump's actions against Iran:**\n\nTrump has recently demanded that Iran would sign a 'nuclear deal' which he threatened Iran with \"bombing... which they have never seen before\" if they do not sign it. Iran has responded that it will not accept Trump's 'unrealistic conditions' of the nuclear deal. Trump is trying to find every reason to go to war with Iran, and will need public support for it. Whether it would lead to a world war is another story, as Russia could be pulled into the conflict.\n\nBe aware of astroturfed campaigns to sway you to have a negative opinion of Iran. The 'weapons of mass destruction' in Iraq was fake, and the jewish elites will try to convince you that a war with Iran is justified and will want you to fight their war without sending any troops of their own. Our 'greatest ally' Israel sent ZERO troops to Iraq or Afghanistan.\n\n**Stay on high alert:**\n\nFor now, the only way we can avert a war against Iran is to ensure that we are not goaded into war with Iran. The Trump administration and the jews in power will try to convince us otherwise through their media tactics. Eyes open and keep noticing until we reach critical mass and have the majority of the population aware.",
    "score": 398,
    "num_comments": 139,
    "created_utc": "2025-03-31 18:23:04",
    "url": "https://www.reddit.com/r/conspiracy/comments/1jo32s3/the_trump_administration_is_preparing_for_war/"
  },
  {
    "id": "10i0fj",
    "title": "Israel Lobbyist suggests False Flag attack to force the US into a war with Iran.",
    "text": "",
    "score": 2069,
    "num_comments": 1029,
    "created_utc": "2012-09-26 15:05:36",
    "url": "http://www.youtube.com/watch?feature=player_embedded&v=M84l19H68mk"
  },
  {
    "id": "1c6onr6",
    "title": "Israel kills twelve Iranian officials in an act of war and there is no Western condemnation or consequences. Iran retaliates, and the US/UK not only jump up to militarily defend Israel but they give Israel the green light to attack Iran again. Isn't this validating Putin's concerns about NATO?",
    "text": "Israel conducted a surprise attack against the embassy of a rival power, killing 12 Iranian officials in total. Despite the flagrant act of war, the US, UK, and EU refuse to condemn Israel in any way, and it was made very clear that any international move to punish/sanction them was dead on arrival. \n\nIran is being backed into a corner by the West, where Israel is allowed to wage war on them while any attempts to retaliate are met with unified Western outrage and action.\n\nThis is the exact scenario that Putin has feared. A Ukraine in NATO, demanding Crimea back, that could cause chaos for Russia and then run behind it's Western allies to tie Russia's hands.",
    "score": 468,
    "num_comments": 369,
    "created_utc": "2024-04-18 04:30:33",
    "url": "https://www.reddit.com/r/stupidpol/comments/1c6onr6/israel_kills_twelve_iranian_officials_in_an_act/"
  },
  {
    "id": "1gxn7a0",
    "title": "Brits will have to die defending Israel in war with Iran, says UK envoy to Tel-Aviv",
    "text": "",
    "score": 1697,
    "num_comments": 51,
    "created_utc": "2024-11-23 05:45:05",
    "url": "https://www.middleeastmonitor.com/20241121-brits-will-have-to-die-defending-israel-in-war-with-iran-says-uk-envoy-to-tel-aviv/"
  },
  {
    "id": "1lhh1u9",
    "title": "Now that Trump started a war with Iran, do you regret vilifying anti-war protestors?",
    "text": "Many of you strongly supported Trump and condemned those protesting Israel’s actions in Gaza, often labeling them anti-American or anti-Semitic. But now, Trump has escalated things into a war with Iran — something many of those same protestors warned would happen if we kept fueling the regional fire.\n\nSo now that we’re in it, do you have any regrets about dismissing or attacking the people who were clearly right about where this was headed? Was it worth it? Or do you now see the value of voices urging de-escalation?\n\nEdit: Since I already see a lot of knowledge gaps coming up here: \n\nThe U.S. overthrew Iran’s democratically elected prime minister, Mohammad Mossadegh, in 1953 after he nationalized oil. We backed the Shah’s brutal dictatorship for 25 years, which led to the 1979 Islamic Revolution. That gave rise to the current regime. Ever since, it’s been a cycle of hostility, sanctions, and proxy wars — all rooted in that original coup. Today’s crisis didn’t start in a vacuum.\n",
    "score": 80,
    "num_comments": 218,
    "created_utc": "2025-06-22 11:15:38",
    "url": "https://www.reddit.com/r/AskUS/comments/1lhh1u9/now_that_trump_started_a_war_with_iran_do_you/"
  },
  {
    "id": "1lhocld",
    "title": "fun fact: Israel went fully into the war with thinking they will do this alone",
    "text": "",
    "score": 335,
    "num_comments": 102,
    "created_utc": "2025-06-22 18:50:00",
    "url": "https://i.redd.it/de2epbg6hh8f1.jpeg"
  },
  {
    "id": "1ldga3f",
    "title": "trump out here teasing a promo for World War, S3 \"Stay tuned!\" 🤦‍♀️",
    "text": "it's worth noting that trump *left the G7 before the planned discussions on Israel-Iran* and [refused to add the USA signature](https://www.reuters.com/world/middle-east/g7-leaders-call-israel-iran-deescalation-draft-statement-2025-06-16/) to a draft letter calling for de-escalation of Israel-Iran conflict  \n\n>A U.S. official said on Monday that President Donald Trump would not sign a draft statement from Group of Seven leaders calling for de-escalation of the Israel-Iran conflict.    \n\n>The draft statement, seen by Reuters, also commits to safeguarding market stability, including energy markets, says Iran must never have a nuclear weapon, and that Israel has the right to defend itself.  \n\n>Canadian and European diplomats said G7 attendees are continuing discussions on the conflict at the summit in Canada, which ends on Tuesday.  \n\nalso, why TF is \"cease fire\" in quotes?? ",
    "score": 6205,
    "num_comments": 800,
    "created_utc": "2025-06-17 11:43:05",
    "url": "https://i.redd.it/l6ohkwggof7f1.jpeg"
  },
  {
    "id": "1lhpuvo",
    "title": "Remember when Hilary Clinton was accused of wanting to get us into a war with Iran. LOL.",
    "text": "To be clear she’s an absolute ghoul. And I hate her too, but holy shit! His supporters went in on her saying she’d start a war with Iran and that’s why we needed to vote for Trump and now look what’s happening. Trump has brought us into Israel’s war on Iran.\n\nNo new wars we were told during Biden’s presidency . No new wars, was one of Trump’s supposed selling points. Never mind that one of the wars Biden was accused of getting America involved in had 0 American boots on the ground and not even an American plane in the sky just material support. Support Trump ended allegedly in the name of peace, but now we’re literally bombing Iran. The thing we were told Hilary Clinton would do back in 2016… ",
    "score": 95,
    "num_comments": 192,
    "created_utc": "2025-06-22 19:56:56",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1lhpuvo/remember_when_hilary_clinton_was_accused_of/"
  },
  {
    "id": "1lcteck",
    "title": "If It’s To Be War With Iran, Let It Be The War That Nobody Came To",
    "text": "https://www.caitlinjohnst.one/p/if-its-to-be-war-with-iran-let-it?utm_campaign=post&utm_medium=web\n\nArticle by Caitlin Johnstone.\n\nAmerica is at war. Not with a middle eastern super power across the seas, but with our disgusting, war mongering, military industrial complex that continues to drive the world into conflict for profit. If war comes with Iran, let this be the one where nobody shows up. Why should the cost of Israel’s war crimes be American lives???? What we are seeing right now is blood for blood. Israel fucked around and are finding out. To the leadership of the united states, I would suggest trying to avoid the find out part. If our incompetent, pathetic, and fascist leaders try to take america to war, the people must refuse. I will not watch my military family and friends die for a country that has been nothing but a parasite to the world. So again, if there is to be war, LET IT BE THE WAR NOBODY CAME TO. ",
    "score": 149,
    "num_comments": 161,
    "created_utc": "2025-06-16 18:53:27",
    "url": "https://i.redd.it/p5bt8msboa7f1.jpeg"
  },
  {
    "id": "1lzxqib",
    "title": "“Congressman, as you eat your breakfast here in congress, we are funding the forced starvation of the Palestinian people”",
    "text": "Over 60% of Americans want to stop arming Israel, and Americans certainly do not want to go to war with Iran. No more endless wars, we want peace!\n#\nhttps://www.codepink.org/iran",
    "score": 4470,
    "num_comments": 828,
    "created_utc": "2025-07-15 01:34:03",
    "url": "https://v.redd.it/dmi0e73ahwcf1"
  },
  {
    "id": "1ld5x90",
    "title": "The war between Israel and Iran is intentional and planned. Israel is trying to drag the USA into the war. Do not fall for the lies propaganda.",
    "text": "What Are the Bibi Files?\n\nThe \"Bibi Files\" refer to a cache of leaked police interrogation footage and related evidence from the Israeli corruption investigations into Prime Minister Benjamin Netanyahu (nicknamed \"Bibi\"). These files include thousands of hours of video and audio recordings from interrogations conducted by Israeli police between 2016 and 2018, as well as interviews with Netanyahu’s family, friends, associates, and wealthy benefactors. The footage was leaked to filmmaker Alex Gibney in early 2023 and became the basis for the 2024 documentary film The Bibi Files, directed by Alexis Bloom.\n\nWhy Are the Bibi Files So Damning?\n1. Unprecedented Visual Evidence of Corruption\n\nUnlike prior leaks that only included audio, the Bibi Files provide direct video evidence of Netanyahu and his inner circle being questioned about bribery, fraud, and breach of trust. This footage offers a candid, unfiltered look at Netanyahu’s responses, demeanor, and strategies under pressure, which many observers and filmmakers describe as exposing his \"venal and corrupt character\".\n\n2. Detailed Allegations and Patterns of Misconduct\n\nThe files document allegations that Netanyahu and his family solicited and accepted expensive gifts (champagne, cigars, jewelry) from wealthy businessmen, including Hollywood producer Arnon Milchan and casino magnate Sheldon Adelson, in exchange for political favors and positive media coverage.\n\nThey also detail Netanyahu’s alleged efforts to manipulate Israeli media by offering regulatory benefits to media owners in return for favorable coverage, most notably involving Israel’s largest telecom company and the Walla! News site.\n\n3. Political and Societal Impact\n\nThe documentary and the files argue that Netanyahu’s efforts to stay in power—including controversial alliances with far-right politicians and judicial reforms—are directly linked to his desire to evade prosecution. The film suggests that Netanyahu’s political maneuvers, including the prolonging of the Gaza conflict, serve as tools to maintain his grip on power and delay or avoid legal consequences.\n\n4. Broader Implications for Israeli Democracy\n\nThe files and the documentary draw a direct line between Netanyahu’s personal legal troubles and broader changes in Israeli society and governance, including the erosion of judicial independence and the deepening of national divisions.\n\n5. Attempts at Suppression\n\nNetanyahu attempted to block the release of the documentary in Israel, citing the illegality of broadcasting such interrogation footage, which has only heightened the perception of the files’ significance and their potential to damage his reputation and political future.\n\n🚨The Bibi Files are considered damning because they provide unprecedented, direct evidence of alleged corruption at the highest level of Israeli government, expose the personal and political strategies Netanyahu has used to retain power, and link his legal troubles to broader societal and geopolitical consequences. Their release has intensified scrutiny of Netanyahu’s leadership and raised profound questions about the state of Israeli democracy.\n\n🚩 Israel says Iran tried to assassinate Trump twice.\n\n🚩 Israel says that Iran has nuclear weapons.\n\n🚩 Israel says they did a pre-emptive strike on Iran before peace talks could take place, because Trump knew and authorized the attack. Trump has not refuted this.\n\n🚩 Trump talks about building a \"golden dome\" missile defense system.\n\n🚩 Israel says Iran will attack New York if Tel Aviv is attacked.\n\n🚩 Israel is trying to pull USA into war with every excuse under the sun (and some classic ones too).\n\nHow do I make money off this?\n\nKeep an eye on the government contracts and see who's getting the funding. ",
    "score": 262,
    "num_comments": 114,
    "created_utc": "2025-06-17 02:54:06",
    "url": "https://www.reddit.com/r/DeepFuckingValue/comments/1ld5x90/the_war_between_israel_and_iran_is_intentional/"
  },
  {
    "id": "1l984hl",
    "title": "A war is coming between Iran and Israel. Here is how you can become rich off of it: OXY Calls",
    "text": "\nA war is about to erupt involving the U.S., Israel, and Iran, Israel is intentionally sabotaging nuclear deal talks. oil prices will likely surge, potentially to $100–$120+. OXY is one of the most sensitive and leveraged plays to oil prices, offering asymmetric upside on any major geopolitical shock. Here.\n\n⸻\n\nWHY I LOVE IT:\n\n1. High Beta to Oil Prices\n\t•\tOXY’s earnings and valuation are directly tied to crude prices.\n\t•\tA $10–$15 increase in oil can massively improve cash flows, causing its stock to react with a 2–3x multiple of oil price gains.\n\t•\tHistorically, when oil goes up 20%, OXY can go up 40–60%+.\n\n2. Warren Buffett Backing = Downside Buffer\n\t•\tBerkshire Hathaway owns ~28% of OXY and keeps buying more under $60.\n\t•\tBuffett’s involvement gives institutional confidence and potential price floor support.\n\t•\tIn a volatile market, this backing protects downside risk while still allowing big upside.\n\n\n3. Operational Leverage & Asset Quality\n\t•\tOXY has top-tier shale assets (Permian Basin) and Middle East exposure.\n\t•\tExtremely efficient cost structure after post-COVID restructuring.\n\t•\tBreak-even cost on production: ~$40/barrel → high-profit margins at elevated prices.\n\n\n4. Balance Sheet & Shareholder Returns\n\t•\tOXY has paid down over $17B in debt since 2020.\n\t•\tWith higher oil, they can accelerate buybacks and dividends.\n\t•\tShareholder returns are expected to grow rapidly if oil holds above $80.\n\n5. Cheap Valuation\n\t•\tTrades at ~9x forward earnings, below historical averages.\n\t•\tPEG ratio under 1 in many models = undervalued on a growth-adjusted basis.\n\t•\tIf oil jumps, multiple expansion + earnings surge = explosive combo.\n\n6. Options Are Cheap (for Now)\n\t•\tCompared to XOM or CVX, OXY’s call options are much more affordable.\n\t•\tHigher implied volatility = more reward for directional bets.\n\t•\tNovember $50 call at ~$2.15 = great leverage on a move to $55–$60.",
    "score": 529,
    "num_comments": 67,
    "created_utc": "2025-06-12 04:55:54",
    "url": "https://www.reddit.com/r/WallStreetbetsELITE/comments/1l984hl/a_war_is_coming_between_iran_and_israel_here_is/"
  },
  {
    "id": "1f80565",
    "title": "Prof. Jeffrey Sachs explains why war with Iran is not in US interests and is being pushed by Israel, as a way to prevent the establishment of a Palestinian State & freedom for the Palestinian people.",
    "text": "",
    "score": 557,
    "num_comments": 165,
    "created_utc": "2024-09-03 18:36:55",
    "url": "https://v.redd.it/syupwg98klmd1"
  },
  {
    "id": "1lfnfok",
    "title": "Global Economic Collapse?",
    "text": "",
    "score": 7487,
    "num_comments": 497,
    "created_utc": "2025-06-20 03:04:56",
    "url": "https://i.redd.it/b0kyxs6niy7f1.png"
  },
  {
    "id": "1jf33cx",
    "title": "Trump Owns the Middle East Wars Now: \"Trump resumed U.S. attacks on Yemen over the weekend and threatened direct war with Iran, which backs the Houthi government. Israel also resumed its own war in Gaza ... and the Trump administration admitted that it was 'consulted' beforehand.\"",
    "text": "",
    "score": 896,
    "num_comments": 51,
    "created_utc": "2025-03-19 22:52:06",
    "url": "https://reason.com/2025/03/19/trump-owns-the-middle-east-wars-now/"
  },
  {
    "id": "1lbm20f",
    "title": "BREAKING: CHINA HAS SENT CARGO JET OF MILITARY AID TO IRAN AMID WAR WITH ISRAEL.",
    "text": "https://x.com/jacksonhinklle/status/1934025603407024506",
    "score": 283,
    "num_comments": 96,
    "created_utc": "2025-06-15 04:23:08",
    "url": "https://www.reddit.com/r/WayOfTheBern/comments/1lbm20f/breaking_china_has_sent_cargo_jet_of_military_aid/"
  },
  {
    "id": "1conjrh",
    "title": "Trump says he’s rethinking his support for a two-state solution after Oct 7, says he’d ‘protect Israel’ if war comes with Iran",
    "text": "",
    "score": 384,
    "num_comments": 310,
    "created_utc": "2024-05-10 16:44:37",
    "url": "https://allisrael.com/trump-says-he-s-rethinking-his-support-for-a-two-state-solution-after-oct-7-says-he-d-protect-israel-if-war-comes-with-iran"
  },
  {
    "id": "1lmkg7t",
    "title": "Allen Dulles and James Angleton are behind the birth of the UFO secrecy program beginning with their recovery of the Magenta, Italy 1933 UFO crash-retrieval as part of the OSS, the birth and reign of the CIA, the conflict between Israel and Iran, Big Oil, Forever Wars, and the Breakaway Civilization",
    "text": "Soon I'll write up a nice long Medium for free yet again connecting all the dots building off the extensive research I've been doing along with others in this space in the hopes of waking everyone up and moving us towards a better future.\n\nNo this isn't AI. I've been posting on these subs for years. My name's Craig Oliver, and along with my good friend who I met on here a year ago Michael Armentor aka u/36\\_39\\_42, we're part of a documentary being made by Jon Sumple and Jack Roth of j3Films which is currently in development.\n\n[https://medium.com/@EscapeVelocity1/our-long-in-the-works-magenta-33-documentary-is-a-go-a0748b994443](https://medium.com/@EscapeVelocity1/our-long-in-the-works-magenta-33-documentary-is-a-go-a0748b994443)\n\nWe did an interview about it recently on our buddy Pavel's Psicoactivo podcast:\n\n[https://www.youtube.com/watch?v=qS-zGxL3UuY&t=3233s](https://www.youtube.com/watch?v=qS-zGxL3UuY&t=3233s)\n\nIf you'd like to see some interview clips I thought were notable, you can watch them here:\n\n[https://www.youtube.com/@MagentaProject1933](https://www.youtube.com/@MagentaProject1933)\n\nAnd here:\n\n[https://www.tiktok.com/@the.magenta.proje](https://www.tiktok.com/@the.magenta.proje)\n\nAnd whatever else here:\n\n[https://x.com/MagentaUFOUAP](https://x.com/MagentaUFOUAP)\n\nBut that it feels like the world's lost its mind and with the conflict between Israel and Iran and the US's place in the middle of all that, it's time to bridge this gap in quick succession for you all. You can dig through Reddit, through Twitter, through YouTube, and you'll easily find sources for all of this.\n\nThree days ago, journalist Joy Reid made an appearance on an MSNBC roundtable regarding Israel and Iran and the clip went viral:\n\n[https://www.reddit.com/r/LateStageCapitalism/comments/1ljye7e/i\\_know\\_whos\\_getting\\_fired\\_from\\_cnn\\_next/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/LateStageCapitalism/comments/1ljye7e/i_know_whos_getting_fired_from_cnn_next/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nNot sure if I can link to Twitter/X, but I'll copy her text below:\n\n>Reid: Why did the Iran hostage crisis take place? \n\n>Todd: Because fundamentalist radicals took over the government \n\n>Reid: They overthrew the shah who we imposed on Iran because the Dulles brothers, one at the CIA and one at the state department, decided that the oil beneath the soil of Iran belonged to BP and belonged to us. And when mossadegh, who was the leader of Iran, the democratically elected leader of Iran, said that we would like to audit BP because we want to know if you are cheating us or paying the people of Iran based on the oil under their soil. And they said, you may not audit us. And then we overthrew him and he wound up dying in prison because we decided in our arrogance as a country, got to own their oil.\n\nYou can read about how the CIA admitted to overthrowing the Shah of Iran in this Guardian article from 2013:\n\n[https://www.theguardian.com/world/2013/aug/19/cia-admits-role-1953-iranian-coup](https://www.theguardian.com/world/2013/aug/19/cia-admits-role-1953-iranian-coup)\n\nThose of you who follow this topic closely are very aware of Eisenhower's speech upon leaving office in which he said \"beware the power of the Military Industrial Complex.\" He was referring to the MIC that the Dulles Brothers and James Angleton and the Bush family built after they recovered the 1933 Magenta, Italy UFO in 1944 with the help of the Vatican. Liberation Day in Rome was about this. You can read about how they began building this empire based around this recovery starting here:\n\n[https://medium.com/@EscapeVelocity1/the-ufo-crash-retrieval-story-is-the-biggest-corruption-case-in-modern-history-and-involves-the-83e7b2392f65](https://medium.com/@EscapeVelocity1/the-ufo-crash-retrieval-story-is-the-biggest-corruption-case-in-modern-history-and-involves-the-83e7b2392f65)\n\nTL;DR:\n\nAllen Dulles was lead co-counsel at Brown Brothers Harriman under George H W Bush's father Prescott Bush and Prescott's father and namesake George Herbert Walker. \n\nJames Angleton was living with his family in Milan, Italy in 1933, three miles from where the Magenta craft was recovered. His father James Hughes Angleton was close with Mussolini.\n\nIn 1935, Dulles and fellow Wall Street lawyer Bill Donovan were diplomats who traveled throughout Europe meeting up with the likes of Hitler, Mussolini, and others and making note of how they were developing their armies.\n\nIn 1939, WWII was started by Hitler and Mussolini. In 1940, FDR knew the US would eventually have to join the war and enlisted Bill Donovan to put together an arm of the OSS. Donovan asked his Wall Street friend Dulles to join.\n\nIn 1942 Angleton became the youngest member to join because he'd been witness to the Magenta crash-retrieval.\n\nThe craft was recovered on June 6th, 1944 following the Liberation of Rome and brought to Army R&D on June 21st.\n\nAfter the end of WWII, the OSS was disbanded and the three men hung back in a smaller office.\n\nAfter the UFO crash-retrieval at Roswell, these men would form the CIA, signed into Executive Order the same day as MJ-12 was created, Sept. 24, 1947.\n\nThese are all things you can find on this and other related subs. If anyone cries bullshit, find the source and call them out.\n\nFollowing the Roswell crash-retrieval, the US created the NSA, the CIA, the Air Force, and the DoD. Allen Dulles, Bill Donovan and James Angleton were behind the creation of the CIA. James Forrestal became the first Secretary of Defense.\n\nAt the behest of Prescott Bush, the CIA began recruiting out of his Yale Skull and Bones secret society.\n\nIn 1948, James Angleton helped create the State of Israel as well as their secret nuclear weapons program.\n\nJames Forrestal was also the person who recommended to FDR that MJ-12 be formed. \n\nThe Kennedys were longstanding family friends with the Forrestals and JFK served under Forrestal in WWII. JFK was out sick during the recovery of Magenta, but towards the end of the war, he and Forrestal went to seek out the German secret superweapons. \n\nForrestal was killed in 1949 days before Battelle Institute was set to test the Roswell alloys. He wanted transparency while the Dulles Brothers and the Bush family and Angleton wanted control.\n\nIn 1948, Dulles's Brown Brother Harriman co-counsel Averill Harriman, who was Secretary of Commerce at the time and helped enact the Marshall Plan alongside Dulles's brother John Foster Dulles who was Secretary of State, made Dresser Industries go public with their stock. Dresser Industries specialized in heavy construction machinery. Dulles and Prescott Bush then placed George H W Bush in charge of Dresser Industries and they began building Deep Underground Military Bases.\n\nIn 1951, while Dulles was Deputy Director of the CIA, with the help of the CIA's Thomas Devine would form Zapata Oil and placed George H W Bush in charge. In the 80s when Bush was called out for being involved with the CIA much earlier than anyone thought, in 1961, his spokesperson Thomas Devine refuted the idea.\n\nIn 1952, Washington DC experienced a wave of UFO sighting including the July DC flyovers.\n\nIn 1953, Allen Dulles would become Director of the CIA under the new President Eisenhower, who was instrumental in helping the US win WWII with the help of Dulles at the OSS.\n\nDulles immediately instated Project Blue Book and Project Mockingbird to gaslight the public on UFOs.\n\nDulles also immediately overthrew the Shah of Iran so that British Petroleum would have access to their oil.\n\nIn 1955, Dulles's Yale Skull and Bones buddy Richard Bissell began developing Area 51 and testing out the U-2. It was originally named Watertown after the town where Allen Dulles grew up.\n\nAlso in 1955, the Glenn L Martin Company ousted its founder and formed the Research Institute of Advanced Science. A year later in 1956, the US published an article touting \"The G-Engines are Coming!\"\n\nIn 1957, the Soviet Union surprised the US by launching Sputnik into space. The US scrambled and created NASA in 1958 which relied entirely on Nazi rocket scientists brought over via Operation Paperclip for its endeavors.\n\nIn 1961 when JFK took office, he knew about UFOs and about the CIA's dirty work. He created the DIA in opposition to the CIA. After the Bay of Pigs, he ousted Allen Dulles, who kept working from his home in Georgetown running the CIA in secret. \n\nAround this time, anti-gravity research went completely dark.\n\nIn 1963, JFK sent out a memo stating he wanted full info about UFOs while he was making a deal with Krushev to disarm their nukes and go public about UFOs. Dulles and Angleton and Bush were behind his assassination.\n\nIn 1969, Allen Dulles died in late January.\n\nA week later, SAIC was propped up and all the secret research the CIA had been doing went dark.\n\nBy the end of the year, Project Blue Book was closed. \n\nA year later, the CIA, the Air Force and SAIC all set up shop at Pine Gap in Australia.\n\nFrom there, who fucking knows. Shit got weird.",
    "score": 377,
    "num_comments": 67,
    "created_utc": "2025-06-28 16:21:04",
    "url": "https://www.reddit.com/r/UFOB/comments/1lmkg7t/allen_dulles_and_james_angleton_are_behind_the/"
  },
  {
    "id": "1ldtrg8",
    "title": "Cause the POTUS doesn’t have absolute power?!",
    "text": "",
    "score": 6894,
    "num_comments": 412,
    "created_utc": "2025-06-17 22:46:49",
    "url": "https://i.redd.it/0t25fvhvyi7f1.jpeg"
  },
  {
    "id": "1lhn3tv",
    "title": "Can the anti-war left PLEASE not make these sorts of mistakes again (RE war with Iran)?",
    "text": "As the world moves towards yet another potential major conflict, once again in the Middle-East, we on the more radical left shall obviously be largely opposed to involvement of the UK in whatever happens.\n\nFrankly, I'm of the belief that escalation increases the likelyhood of Iran eventually actually getting a nuclear weapon in the longer run. All the talk of a war leading to the end of the Iranian regime is probably wishful thinking, if I'm asked, as bombing a population only strengthens their affinity for their regime (think of the \"rally around the flag\" effect). Essentially, this is going to be a wasteful war, with no real benefit, and I do fear that the UK will get involved in at least some minor way. So to be clear, I am on the side of us staying away from involvement in the Israel-Iran war, and will be protesting as such.\n\nThat said, I KNOW, from mild past experience that a lot of people on the left WILL take these sentiments to an idiotic extreme. That idiotic extreme will lead to stupid, stupid lines being regurgitated. I can predict them now: \"we must stand with the Iranian state\", \"the regime of Iran is fighting western imperialism and is thus worth backing/excusing\", etc. Essentially, the same sort of echo-chamber, one-dimensional rubbish as when the parts of the radical left decided, somehow, that it was OK to directly regurgitate Russian propoganda when they invaded Ukraine.\n\nFor fucks sake, could we not, for once? As much as we will oppose our country's involvement in a pointless war, we don't remotely have to show solidarity with *a dictatorial, theocratic regime, that is after nuclear weapons* (remember, that thing we *also* oppose?). If our collective line starts sounding remotely like that, then we'll only alienate ourselves from the wider UK public, who the militarists will then more easily sway to supporting involvement in the conflict.\n\nTo anybody on the left, who like me, will be out protesting our involvement (preemptively, or as it occurs as events unfold), please, please, please, be careful what you end up agreeing with, and don't blindly follow a line or political personality's take without question.\n\nIf you would care to, focus on this: this war is entirely the product of Donald Trump's BS. HE and his admin ripped up the Iran nuclear deal in 2018, HE purposefully has antagonised Iran in his first term. You can reasonably add Israel's government's actions to the pile of blame, as their strikes against Iran effectively scuppered talks between Iran and European nations on restoring some kind of deal. The more we give attention to those factors, rather than some kind of sense of \"solidarity\" with the Iranian regime, the better chance we have of avoiding involvement by our own nation state.\n\nJust my take, in any case.\n\nEDIT (because I know this will come up): Stating solidarity with the Iranian *people* (not their government) is perfectly fine IMO, by all accounts they widely hate their government.",
    "score": 91,
    "num_comments": 144,
    "created_utc": "2025-06-22 17:49:24",
    "url": "https://www.reddit.com/r/LabourUK/comments/1lhn3tv/can_the_antiwar_left_please_not_make_these_sorts/"
  },
  {
    "id": "1lbf2xm",
    "title": "All of the Top Republicans and Democrats are cheering for World War III to kick off with Iran and Israel. Bernie Sanders, please, for the love of humanity, just start a new party!",
    "text": "",
    "score": 622,
    "num_comments": 42,
    "created_utc": "2025-06-14 23:09:01",
    "url": "https://www.reddit.com/r/SandersForPresident/comments/1lbf2xm/all_of_the_top_republicans_and_democrats_are/"
  },
  {
    "id": "1fttw6g",
    "title": "Why did Hamas and Hezbollah start a war with Israel they would inevitably lose?",
    "text": "Why does Israel’s neighbours believe that after at least 6 failed military invasions they can still win? Jews have lived in the region for 3000+ years, they’re not going anywhere. Did they expect the world and all the nearby Arab nations to invade Israel as well? How could they honestly think after the horrific events of October 7th the world would still be on their side? None of their wars have had any success whatsoever in weakening Israel or shrinking its territory. \n\nDo they believe Allah will protect them and lead them to victory ? Israel and the US are two of the strongest military powers in the world. Do they just wish to turn themselves and their population into martyrs? Even from a PR perspective Hamas’ plan has largely failed since no nation has imposed economic sanctions on Israel so far and the genocide accusations are obviously false. If you’re planing to exterminate a group you don’t warn them before military strikes and vaccinate their children for Polio. \n\nA war with Iran or a broader regional war would be disastrous for the Iranian regime and lead to so many more deaths. I hope eventually peace and stability can return to the region. The US military seems to be relatively uninvolved in the current conflict and have not said they will assist Israel push Hezbollah out of southern Lebanon. Is this because there’s an election coming up or do they naively believe it’s possible to make peace with an internationally recognized terrorist group like Hezbollah?  \n\nWhat do you think is the correct response to the aggression Israel has faced so far? What should they be doing, if anything, to avoid a regional war? Will Iran retaliate after so many members of Hezbollah were killed ? ",
    "score": 71,
    "num_comments": 509,
    "created_utc": "2024-10-01 22:32:23",
    "url": "https://www.reddit.com/r/IsraelPalestine/comments/1fttw6g/why_did_hamas_and_hezbollah_start_a_war_with/"
  },
  {
    "id": "1lc7sur",
    "title": "Sources: US Will Enter Israel’s War With Iran",
    "text": "",
    "score": 244,
    "num_comments": 88,
    "created_utc": "2025-06-15 23:47:51",
    "url": "https://news.antiwar.com/2025/06/15/sources-us-will-enter-israels-war-with-iran/"
  },
  {
    "id": "1lhrcuo",
    "title": "AIPAC demands Democrats “stand with Israel” on Iran",
    "text": "[https://israelpalestinenews.org/aipac-demands-democrats-stand-with-israel-on-iran/](https://israelpalestinenews.org/aipac-demands-democrats-stand-with-israel-on-iran/)\n\n**The pro-Israel lobbying group has sent a flurry of communications to members of Congress, citing specific language for them to parrot in support of Israel’s strikes on Iran.**\n\n>The American Israel Public Affairs Committee (AIPAC) has been furiously urging House Democrats to release messages of steadfast support for Israel in its war with Iran, the Prospect and Drop Site News have learned, even as bipartisan lawmakers come together on a War Powers Act resolution to prevent U.S. troops or funds being used in yet another Middle East conflagration.\n\n# One member relayed that a colleague had received literally 100 phone calls from members of AIPAC and its allied pressure groups. AIPAC wants House Democratic members to state explicitly that they “stand with Israel” in its actions against Iran aimed at destroying the Islamic Republic’s nuclear capability, and add that Iran “must never have a nuclear weapon.”\n\n>  \nIn addition, AIPAC has taken particular pains to denigrate the moderate pro-Israel group J Street, both in private conversations with members of Congress and in public, picking a fight aimed at blocking any Democrats from using J Street as cover to deviate from AIPAC’s maximalist position. “They’re worried their members in Congress may start to shift toward J Street and they’re trying to head that off,” said an aide to one Democrat.\n\n>“I did see that AIPAC took issue with my [statement](https://x.com/RepJayapal/status/1933356964320333946),” said Rep. Pramila Jayapal of Washington state. “They were taking on J Street for endorsing me, which was ridiculous.” To get a sense of how extreme AIPAC’s demands are, note that J Street’s own [statement](https://jstreet.org/press-releases/j-street-statement-following-israeli-attack-on-iran/) merely calls for diplomacy while still supporting Israel. “We urge the Trump Administration to meaningfully pursue a diplomatic resolution to this conflict as quickly as possible while making clear the US will do what is necessary to defend Israel and US troops from retaliation,” the statement read.\n\n>AIPAC [issued the same tweet](https://x.com/AIPAC/status/1934004595686101077) in response to any statement that fell short of its expectations, such as one by [Rep. Greg Casar of Texas,](https://x.com/RepCasar/status/1933334585376715266) which called for a diplomatic resolution: “Consistent pattern: J Street endorsees issue anti-Israel statements. u/jstreetdotorg is many things, but it’s not pro-Israel.”\n\n>The messages reflect one way special interests shape policies in Washington, where a conforming statement is a metric lobbyists can cite to show their dominance. While not everyone received this bombardment of communications from AIPAC officials—particularly progressives who have made their views known about Israel’s actions—judging by a substantial portion of House Democrats, the effort appears to be having an effect.\n\nThis is all clipped from the linked article at the top, but you should really read the whole thing. It is outrageous how much AIPAC bullies members of Congress that do not immediately send out full support of Trump and his actions in Iran. Kind of shocking we allow lobbies to have this much influence over our politicians. ",
    "score": 285,
    "num_comments": 77,
    "created_utc": "2025-06-22 21:00:35",
    "url": "https://i.redd.it/fmn0gjhg3i8f1.png"
  },
  {
    "id": "1lb93et",
    "title": "Chuck Schumer & Hakeem Jeffries agree with Trump that we should go to war with Iran!",
    "text": "If you are wondering why we are going to war with Iran & you see no outrage from Schumer & Jeffries, it is because they too want to go to war with Iran.\n\nHakeem Jeffries put out the statement that is screenshotted in the post. [Here is a link to the statement.](https://democraticleader.house.gov/media/press-releases/leader-jeffries-statement-situation-middle-east) Chuck Schumer also made it clear in his statement that [he supports the war with Iran.](https://www.democrats.senate.gov/newsroom/press-releases/leader-schumer-statement-on-israels-strikes-on-iran)\n\nSchumer & Jeffries make it clear that supporting whatever Israel does is more important than diplomacy. They don't explicitly endorse the war, but they do implicitly.\n\nThat's because Schumer & Jeffries are cowardly pedants who know how unpopular war is. So they will lecture the base that they didn't endorse war with Iran becuase they didn't explicitly state their support. This is an argument of sophistry.\n\nJeffries & Schumer know how deeply unpopular their position is, so they remain silent & they don't share their statements on social media:\n\n[No comments from Chuck Schumer](https://x.com/SenSchumer), on either[ of his accounts.](https://x.com/chuckschumer)\n\n[No comments from \"Senate Democrats\"](https://x.com/SenateDems)\n\n[No comments from Hakeem Jeffries](https://x.com/RepJeffries), on either of [his accounts.](https://x.com/hakeemjeffries)",
    "score": 342,
    "num_comments": 70,
    "created_utc": "2025-06-14 18:46:49",
    "url": "https://i.redd.it/1g3logjbdw6f1.jpeg"
  },
  {
    "id": "t50av",
    "title": "Many of George W.'s pro-war, Israel-first neoconservative advisers, the same ones who gave us bomb Afghanistan and the Iraq war with no WMDs, are now Mitt Romney's closest policy advisers.",
    "text": "",
    "score": 1575,
    "num_comments": 605,
    "created_utc": "2012-05-03 17:51:54",
    "url": "http://my.auburnjournal.com/detail/205607.html"
  },
  {
    "id": "1lecxto",
    "title": "Israel aims to drag US into war with Iran, ensuring American participation.** - Gallant",
    "text": "",
    "score": 458,
    "num_comments": 49,
    "created_utc": "2025-06-18 14:43:09",
    "url": "https://v.redd.it/hsq380ihpn7f1"
  },
  {
    "id": "1c3rh0q",
    "title": "Instantaneous retaliatory strikes by Israel were called off yesterday after Biden called Netenyahu, warning of uncontrollable escalation into war with Iran. ",
    "text": "[Additional](https://www.nytimes.com/live/2024/04/14/world/iran-israel-gaza-war-news/26c42c04-8797-5845-851f-c7e6bed1858b?smid=url-share)",
    "score": 626,
    "num_comments": 145,
    "created_utc": "2024-04-14 16:33:39",
    "url": "https://www.nytimes.com/2024/04/14/world/middleeast/biden-netanyahu-israel-iran-strikes.html?smid=url-share"
  },
  {
    "id": "1hf2f2w",
    "title": "2 Months Ago during a talk at Yale, Danny Sheehan said, \"aliens are coming to intervene because they can't allow us to destroy the life generating capabilities of the planet and the government knows this.\"",
    "text": "2 months ago, during a lecture at Yale, Danny Sheehan said to a room full of people, \"aliens are coming to intervene because they can't allow us to destroy the life generating capabilities of the planet and the government knows this.\" He went on to say to tell your friends and family to prepare because it's going to be a shock to society.\n\nLet's examine this. Danny was the lawyer for Elizondo. It would make sense that he could know things like this from their attorney/client privilege. Also, Danny is not bound to their security clearances. He can just go publicly say what he knows and he doesn't have to say who his source is, but it seems pretty obvious. It's clear Danny believes what he's saying, so unless he's been lied to, this seems to be likely. If you haven't heard the entire talk, you should.\n\nFast forward to now, and what is going on? Unexplainable \"drones\" and orbs EVERYWHERE. We are closer to nuclear war than ever before. The U.S. and Israel is hell bent on taking out Iran, which seems likely to start WW3. We all know the history of UFOs over nuclear bases, over Fukushima, clearly they're concerned with preventing the destruction of the planet. The question is, if they are coming to intervene, will it be peaceful or will they decide humans are a virus on this planet that must be wiped out? [Danny Sheehan at Yale](https://youtu.be/T7ghLflxPs8?list=PLZMxORXDOncf1Qn4IS2Y5yYiYSQinzPsH&t=2599) Video is timestamped at the moment he says this",
    "score": 6793,
    "num_comments": 1800,
    "created_utc": "2024-12-16 02:08:12",
    "url": "https://www.reddit.com/r/UFOs/comments/1hf2f2w/2_months_ago_during_a_talk_at_yale_danny_sheehan/"
  },
  {
    "id": "1lep5j7",
    "title": "Amid escalating MiddleEast tensions, Iran's AyatollahKhamenei warned the US against intervention in the ongoing conflict with Israel, threatening “irreparable damage.” This follows a fierce aerial war and inflammatory remarks by US President DonaldTrump.",
    "text": "",
    "score": 40,
    "num_comments": 145,
    "created_utc": "2025-06-18 23:47:45",
    "url": "https://i.redd.it/jp14bemneq7f1.jpeg"
  },
  {
    "id": "1fdlrps",
    "title": "The DSA must condemn Harris' promise to continue the genocide and pull the US into a war with Iran to protect the genocidaires. No member of the DSA should vote for Harris or any democrat that supports her. ",
    "text": "",
    "score": 55,
    "num_comments": 505,
    "created_utc": "2024-09-10 21:13:59",
    "url": "https://i.redd.it/3c5tllgja0od1.png"
  },
  {
    "id": "8g92g3",
    "title": "Israel seems to be preparing for war with Iran, U.S. officials say",
    "text": "",
    "score": 984,
    "num_comments": 672,
    "created_utc": "2018-05-01 19:58:21",
    "url": "https://www.nbcnews.com/news/mideast/israel-seems-be-preparing-war-iran-say-u-s-officials-n870051"
  },
  {
    "id": "1lb85y3",
    "title": "Iran is not our stick to hit Israel with",
    "text": "Throughout the last two days we have seen unprecedented imperial core aggression towards Iran. They've bombed apartment buildings and civilian areas, justifying it by calling them assassinations. Iranian nuclear research facilities were also hit, leading to significant environmental damage that might take decades to fully clean up. High-ranking military officials and scientists were killed with their families, with Israel trying to create an environment of fear where everybody could be potentially hit.\n\nIran is receiving no official support from any government, besides empty denouncements of naked Israeli aggression. Russia has their hands full with their own war against the imperial core, and China has shown time and time again that they will not involve themselves in any sort of international dispute, not even barring genocide. If anything, Iran has been the ONLY sponsor of containing Israeli aggression in the past 20 years, by supporting the Syria, Hezbollah and Yemen.\n\nMeanwhile, Israel has had full backing of their allies, both in word and deed. Western governments toe the American/Israeli line that Iran has been escalating, the US and the UK have been involving their airforces in protecting Israeli airspace, Jordan is shooting down Iranian missiles and turning their civilian population into debris victims. Western governments are selling the most developed military tech to Israel at a discount, and let's not forget the nuclear elephant in the room.\n\nDespite all this, they decided to retaliate in force and terror bomb Tel Aviv. The Israeli Ministry of Defence compound has seen significant destruction, the Iron Dome has been outed for the fraud it is. Zio settlers had to run to their shelters multiple times and are playing victim on social media right now. I've seen footage of Fox new reporters running away once they realised the Iranian missiles were penetrating defences, stuff I've never seen before in my almost 30 years in this hellscape.\n\nSo I am very disappointed to see many fellow socialists and communists denounce the Iranian leadership for being 'too meek' and the Iranian response for having been 'too muted', even after the attacks on Tel Aviv! I've seen people unironically expect the Iranian government to shoot down Netanyahu's plane over Greece. \n\nI think many people rightfully feel extreme anger and hatred towards the Zionist entity, as do I, but it's very typical for western leftists to want to risk global south proletarians in order to vent this anger. Iran is constantly risking imperial core boots-on-the-ground intervention. Half of the elected US officials have made it their last wish to see Iran burn, that Holden Bloodfeast meme isn't ironic. Iran has to be very careful and measured in their response if they don't want to end up fighting a Western invasion.\n\nObviously this intervention would never end well, the US is even more incapable of waging a major sustained land offensive than they were at the time of Iraq, and Iran is a country with 4 times their population covered mostly in mountains. But it would cost millions of Iranian lives, which is what they Iranian government is rightfully trying to prevent.\n\nThe only chance they have right now is hyperfocusing all of their efforts in actually developing nuclear weapons. Until they do, they will be stuck there they are now, being unable to retaliate accordingly without risking full-scale intervention",
    "score": 412,
    "num_comments": 52,
    "created_utc": "2025-06-14 18:00:25",
    "url": "https://www.reddit.com/r/TheDeprogram/comments/1lb85y3/iran_is_not_our_stick_to_hit_israel_with/"
  },
  {
    "id": "1lhbu92",
    "title": "Title: What's really going on with Iran, Israel, and the West? Would love your take?",
    "text": "Hello Redditors,\n\nI've been following the recent developments in the Middle East, and here's my current understanding of the geopolitical dynamics. I'd really appreciate your insights or corrections if you see things differently.\n\n1. **Iran vs. the West (led by the USA)**: Iran has long been at odds with the West, especially the U.S., and has extended its influence in the region by supporting groups and governments in Iraq, Syria, Lebanon (via Hezbollah), and Gaza (via Hamas). Some believe that Hamas overplayed its hand recently, potentially at Iran's urging. In response, Israel now views Iran as an existential threat and seems determined to weaken or even overthrow the regime in Tehran.\n2. **The nuclear question**: As far as I can tell, Iran does *not* currently possess nuclear weapons. Yet the West (especially Israel and the U.S.) has used the fear of a nuclear Iran as justification for preemptive strikes and broader efforts to destabilize the regime—similar to the narrative used before the Iraq War with Saddam Hussein.\n\nI'd also love to hear your thoughts on the **U.S.–Israel relationship**. Is it purely strategic? Ideological? Something else?\n\nI’m open to all perspectives — please keep it respectful and informative. Thanks!",
    "score": 19,
    "num_comments": 153,
    "created_utc": "2025-06-22 06:11:29",
    "url": "https://www.reddit.com/r/Askpolitics/comments/1lhbu92/title_whats_really_going_on_with_iran_israel_and/"
  },
  {
    "id": "1l4ulbc",
    "title": "Democrat Senate Minority Leader Chuck Schumer pushes for war with Iran: “If TACO Trump is already folding on Iran, Americans need to know.”",
    "text": "I'm almost convinced that this guy is a Mossad agent masquerading as the most powerful Democrat in the US Senate. \n\nChuck Schumer was one of only eleven Democrats in Congress [to break for the Trump budget bill](https://www.nbcnews.com/news/amp/rcna201446) after Israel warned that it needed the weapons in the bill.\n\n\"My job is to keep the left pro-Israel\" - [Chuck Schumer, 2025, New York Times](https://www.nytimes.com/2025/03/18/opinion/schumer-trump-antisemitism.html)\n\nIn the 1990's, Chuck Schumer [received what amounted to $22,000 in political donations from another well-known Mossad agent](https://nypost.com/2019/07/10/schumer-got-thousands-in-donations-from-jeffrey-epstein/), back when the individual donor-candidate limit was $2,000 per election cycle.\n",
    "score": 232,
    "num_comments": 83,
    "created_utc": "2025-06-06 20:00:23",
    "url": "https://x.com/senschumer/status/1929676991789203528?s=46"
  },
  {
    "id": "1kwki80",
    "title": "Wikipedia entry for \"Misinformation in the Gaza war,\" first countries are \"RUSSIA, CHINA, IRAN AND ITS PROXIES.\" Israel is not mentioned until the third paragraph",
    "text": "",
    "score": 639,
    "num_comments": 36,
    "created_utc": "2025-05-27 16:07:51",
    "url": "https://i.redd.it/fdo0linf4b3f1.png"
  },
  {
    "id": "1ldt0wm",
    "title": "Trump Indicates United States Has Joined War with Israel Against Iran",
    "text": "",
    "score": 150,
    "num_comments": 99,
    "created_utc": "2025-06-17 22:18:33",
    "url": "https://www.msn.com/en-us/news/politics/donald-trump-indicates-united-states-has-joined-war-with-iran/ar-AA1GTt8q"
  },
  {
    "id": "1lhujip",
    "title": "CMV: We're nowhere close to WW3",
    "text": "Despite what people on the internet are worried about, we're nowhere near World War 3 now, or for the foreseeable future.\n\nThe simple fact is that in the two major conflict zones right now, Israel/Iran & Russia/Ukraine, at least  one side doesn't have a mutual defense pact with a strong enough country to trigger a cascade like what happened in WW1.\n\nIran doesn't have allies that care about it (Russia could have been seen as that, but they've publicly washed their hands of the situation), to the point that their own proxies like Hezbollah aren't getting involved.\n\nUkraine has the backing of the West, but no country has agreed to commit troops, and while Russia is getting support from North Korea, it's both ineffective and stops there.\n\nThe China/Taiwan crisis could escalate, but that doesn't look likely and would probably be confined to the Asia-Pacific region, not spilling into land wars in Europe, Americas, or the middle East.",
    "score": 2792,
    "num_comments": 748,
    "created_utc": "2025-06-22 23:12:50",
    "url": "https://www.reddit.com/r/changemyview/comments/1lhujip/cmv_were_nowhere_close_to_ww3/"
  },
  {
    "id": "1law389",
    "title": "Israel’s current war with Iran will distract from the holocaust in Gaza",
    "text": "",
    "score": 1244,
    "num_comments": 8,
    "created_utc": "2025-06-14 05:56:23",
    "url": "https://i.redd.it/g4nrs48vjs6f1.jpeg"
  },
  {
    "id": "1llvwfp",
    "title": "I wrote a 40 page essay describing why Israel was not morally justified in bombing Iran, with links",
    "text": "The link is [here](https://docs.google.com/document/d/e/2PACX-1vRvsk63eC34v8MrHNCvNqoXinmx7AQHNdM43yWJqXhDshf4qbEAfUpyQmTSKbLcGczfGsnUeyMxbhR0/pub). It is a Google Doc so when accessing links you may have to open them in a private window, as [archive.is](http://archive.is) does not play nice with Google Docs. Originally it was 23 pages, because I finished it on June 22, the same day Trump decided to bomb Iran. This is a \"second edition\" that includes an expansion on what I think Netanyahu's true motives are, as well as a brief addendum discussing Trump bombing Iran. I wrote this solely to organize my thoughts, nothing more. I sent the first draft to Destiny, figuring there was a 2% chance of him actually reading it, but now I figure it's probably closer to 0.01% so I am sharing it here.\n\nTL;DR\n\n1. Israel's main claims to justifying the bombings, are that Iran was posing an immediate threat through its accelerated uranium enrichment, as if the 60% uranium stockpile was enriched to 90%, that can be weaponized.\n2. There is no evidence, anywhere, that Iran possessed 90% enriched uranium or was actively weaponizing. The Israeli government doesn't even make that claim.\n3. The problem with this argument, is that Iran already possessed enough 60% uranium-235 to produce a nuclear bomb (if enriched to 90% uranium-235) back in November 2022. It increased this stockpile several times, to the point where it could produce 2 bombs in 2023 and 3 bombs in 2024. This means this \"immediate threat\" existed for two and a half years, yet Iran never weaponized its uranium at any point.\n4. So this naturally leads to the question, \"why bomb Iran now?\" The strongest possible argument to this, is that Israel may have gained \"secret intelligence\" sometime in 2025 to justify bombing Iran.\n5. There are multiple problems with this argument, however. For one, Netanyahu and the Israeli government never make any definitive claims about whether or not Iran is actually weaponizing its uranium. They speak almost entirely in hypotheticals (i.e. Iran could have a bomb in a few months, in a year, etc). If they had definitive intel that Iran was weaponizing its uranium or enriching it to 90%, we would expect the Israeli government to make definitive, confident claims (such as Iran IS producing nuclear weapons). To compare, the Biden administration was very definitive in claiming Russia would invade Ukraine \"in the coming week.. in the coming days\".\n6. There is also nothing stopping Israel from releasing at least *some* intel to verify their claims. Again, the Biden administration was willing to declassify some satellite imagery to show Russian troop movements.\n7. There is also nothing stopping Israel from sharing their intel with US intelligence, so US intelligence could corroborate their claims. Bafflingly enough, American intelligence was already aware Israel was planning on bombing Iran at least as far back as February 2025. So Israeli intelligence was willing to share battle plans, but for some inconceivable reason, could not share the intel justifying the bombing itself.\n8. An alternate argument is that Iran acquiring so much uranium can act as a deterrent towards Israel - so long as there is always a threat Iran can nuclearize, this may restrict Israel's military actions against Iran's proxy groups (such as Hamas, Hezbollah, and the Houthis)\n9. The problem with this argument is that Iran already had enough uranium to produce 2 nuclear bombs in 2023, and 3 nuclear bombs in 2024, yet this did not deter Israel's military actions against these proxy groups. Furthermore, if Iran building a nuclear weapon is truly an existential threat, we would expect Israel to prioritize targeting Iran first, as that would be the greatest threat.\n10. The Israeli government brings up these proxy groups as an imminent threat to Israel, when trying to justify the bombings, but does not establish at all how bombing the uranium enrichment facilities affects these proxy groups or how they are connected in any way\n11. Bombing Iran's uranium enrichment facilities is a short-term solution, various experts believe even if Fordo was destroyed, Iran could rebuild in a matter of years because Iran already has the knowledge of enriching uranium, which is truly hard to \"kill\". It can have unintended consequences, such as pushing Iran to weaponize faster, or relying on more covert means.\n12. The only real advantage of bombing the uranium enrichment facilities is \"buying time\". But buying time for what? Without a long-term strategy it isn't meaningful in the end\n13. Another major strategic failure is that Israel did not actually target Iran's 400kg 60% uranium stockpile itself, presumably because bombing that would lead to environmental damage. America now has no idea where it even is\n14. The bombings also thwarted active diplomatic talks in Oman, and America knowing about them in advance suggest the negotiations were bad faith. This is not good for the future, as Iran will now likely also engage in bad faith in future negotiations.\n15. In light of all of the above, bombing Iran does not justify the civilian casualties, especially since Iran was open to negotiations before (through the JCPOA) which was a peaceful alternative that did not lead to civilian casualties, and was willing to continue the Oman talks (which Israel interrupted through its bombings)\n16. One criticism of the JCPOA was that it had sunset clauses after 15 years. While this is also a \"delay\", the reason why these clauses exist is because society and culture change, and 15 years give negotiators wiggle room to reassess if the deal is working or needs to be renegotiated. It is also a delay that does not lead to civilian casualties.\n17. Vague appeals to \"Iranian history with Israel and America\" and arguments that Iran has historically been antagonistic to America and Israel do not apply here and are a red herring. Yes, Iran has funded proxy groups like Hezbollah, Hamas, and the Houthis to attack Israel. That still does not justify bombing civilians, anymore so than arguing that it is justified to kill Americans because the American government historically engaged in forced regime changes, unless you can firmly establish the link from bombing the uranium enrichment facilities to these proxy groups or firmly establish what the strategic objective is that justifies civilian deaths.\n18. I speculate that Netanyahu's motives were mostly political, his coalition was dysfunctional and he needed a way to unite them while taking political pressure off himself\n19. There are various other points and arguments but this post is becoming too long for a TL;DR, I elaborate more in the essay with links\n\n**EDIT: Since most of you are apparently very bad at reading, I have to explain even more points for you, that I already address in my paper, making this TL;DR, paradoxically, even longer**\n\n20. \"Iran had a history of antagonizing Israel and wishing for its destruction you can't ignore that\"\n\n**I don't ignore it, I discuss it.**  \n\"It is true that Iran, historically, has funded and supported proxy groups that have engaged in terrorist attacks against Israel, such as Hamas, Hezbollah, and the Houthis; namely with money, weapons, training, and intel. Regarding the proxy wars of 2023, the [Washington Post reported](https://archive.is/2aWzN) that various Western and Middle Eastern intelligence officials believed Iran gave Hamas “military training and logistical help as well as tens of millions of dollars for weapons” although they admitted “they have no firm evidence so far that Iran authorized or directly coordinated the attack that killed more than 900 Israelis and wounded thousands.” There was also evidence that Hamas [attempted to contact Iran](https://archive.is/f5xxB) in advance of the October 7 attacks, and although a senior Iranian commander claimed to support Hamas’ actions in “principle”, the declassified documents have suggested Hamas carried on the attacks without Iran’s actual support.\"\n\n\"Iran is not blameless, as they, too, have engaged in retaliatory strikes against Israel through drones and ballistic missiles (which have harmed civilians) and have had a history of engaging in proxy wars with Israel through groups such as Hezbollah, Hamas and the Houthis. Based on recent reports from the IAEA, they are being deliberately opaque and noncompliant with their uranium enrichment program and have more than doubled their 60% enriched uranium stockpile over the course of a single year. While this warrants vigilance, Israel has not provided any compelling evidence of Iran’s nuclear proliferation, which is the main justification behind their attacks that carry the weight of civilian casualties. Based on publicly available evidence, Iran, if anything, seemed to have deliberately chosen to not enrich their uranium to 90% over the course of several years, perhaps to serve as a bargaining chip for future negotiations, as a deterrent, to secure more regional influence, or some combination of all of the above\"\n\n**However, it is a red herring in the context of the bombing itself because the Israeli government does not explain how, strategically, bombing the uranium enrichment facilities affects any proxy groups in the area. If you say \"well Iran bad, therefore, it's okay to bomb them and get civilians killed\" this is literally a \"he was no angel\" argument, you can use this to justify bombing America and killing American civilians because of America's history of forced regime changes and funding proxy groups as well. Killing civilians is not justifiable unless it fulfills a legitimate long-term strategy that justifies killing those civilians in the first place, which I argue, Israel has failed to elaborate on.**\n\n**If your argument is unironically \"well it's war, Iran started this war Israel can just kill whatever civilians they want\" this is another unhinged argument, which for some reason is very popular here. Morally speaking, if Israel is going to perform military actions that will harm civilians there has to be a strong reason for it besides \"Iran bad\". That is an important aspect of a \"just war\".**\n\n21. \"Israel didn't bomb Iran before, because they were preoccupied with proxies, which were weakened in 2025\"\n\n\"My criticism of this argument is if Israel genuinely believed Iran was pursuing a nuclear weapon, that would be an actual existential threat to Israel. Netanyahu and the Israeli government have literally stated this themselves. So logically, for Israel it would have made far more sense to prioritize Iran as a military target first, despite the potential risks of escalating proxy groups, since Iran would have posed the greatest threat. \"\n\n\"This line of argumentation is also in contradiction with one of the proposed rebuttals, that Israel was justified in bombing Iran to weaken proxy groups, or because Iran’s uranium stockpile acted as a deterrent to Israeli military operations against those groups. If the argument now is that Israel was too preoccupied striking the proxy groups, that is evidence that Iran’s stockpile at the time (which was already enough to produce one bomb) was not an effective deterrent. Strategically, it is also in contradiction – if the idea is that bombing Iran’s uranium enrichment facilities somehow weakens the proxy groups, then that would be yet another justification, on top of the existential threat of a bomb, to prioritize bombing Iran first.\"\n\n**To simplify it for you, if Iran's uranium enrichment was genuinely a threat, it would have made more logical sense for Israel to prioritize bombing Iran's uranium enrichment facilities in 2023, because Iran actually pursuing nuclear weapons** ***is*** **an existential threat. The fact that they did not do that, suggests that they did not take Iran's uranium enrichment seriously.**\n\n22. \"Israel didn't bomb Iran before, because Biden didn't want to\"\n\n\"There is, however, one other problem with this line of reasoning. If there truly was a credible, imminent threat of Iran pursuing nuclear weapons, or pursuing 90% uranium enrichment, wouldn’t the Biden administration have permitted, or even supported bombings in Iran? It is not only in Israeli security interest for Iran to not pursue nuclear weaponization – it is also in American and arguably global security interests that Iran is not in possession of a nuclear bomb. However, the United States did not make any mention of Iran potentially pursuing nuclear weapons at all during this period, despite their uranium stockpile exceeding the amount necessary to produce a bomb.\"\n\n**This effectively argues that Biden was intentionally negligent of Iran's threat. I have no reason to believe this is the case, considering A. he was very decisive when it came to acting against Russia invading Ukraine and B. Iran literally didn't weaponize at all during his administration.**\n\n23. \"Yeah, but they had 400kg of 60% enriched uranium!\"\n\n**Iran already possessed 62kg of 60% enriched uranium in 2022, 114 kg of 60% enriched uranium in 2023, and 182 kg of 60% enriched uranium in 2024. If that was all enriched to 90% uranium-235, that is enough for 1, 2, 3 nuclear bombs. Yes, Iran has more uranium now and** ***accelerated*** **the enrichment of 60% uranium. However, the threat from 9 potential nuclear bombs, is not meaningfully different from 1, 2, or 3 nuclear bombs. If the quantity of the stockpile necessitates urgency, then Israel should have bombed Iran years ago, because the greatest threat, by far, is 1 nuclear bomb. If the acceleration of the uranium stockpile warrants urgency, Israel has not demonstrated or explained how this is a unique issue, compared to any other year. This undermines the idea that bombing Iran was done because Iran was posing an \"immediate\" threat.**\n\n**Additionally, if the goal is nuclear weaponization why didn't they just... enrich their preexisting uranium to 90%? Why didn't they do that for multiple years? Why sit on a 60% stockpile? I argue, it is likely because they wanted to use it as a bargaining chip for future negotiations with the US, and as a (failed) deterrent.**\n\n24. \"But Israel did bomb Iran before\"  \n**No, they did not recently bomb Iran's uranium enrichment facilities. They bombed Iran's consulate at Damascus, which led to Iran retaliating in October, and a further retaliation from Israel. This has no relevance to anything I've discussed.**\n\n25. \"TL;DR lol\"  \n**You all mock Hasan for having shallow political takes and not reading things, yet here you are, engaging in the same behavior. You all claim to favor rationality and strong argumentation, yet don't engage with meaningful arguments. The \"pragmatic\" \"rational\" community, everyone.** **Israel bombing Iran is a complicated issue involving moral frameworks, geopolitics, and multiple countries, of course I can't summarize everything in a handful of sentences.**\n\n**EDIT 3: I would like to give a special shout out to** u/Parablesque-Q, [who tried to argue that Just War theory doesn't matter or apply to Israel, because no one abides by it in the Middle East](https://imgur.com/XYt7XHB)[, which implies that he believes Israel is morally justified to kill virtually anyone they feel like for any reason](https://imgur.com/EgHtMfD)**, since Just War theory demands distinction between combatants and non-combatants, proportionality, military necessity, and so on when considering whether or not military actions are morally justified. He may have genuinely failed to understand that Just War theory is** [an ethical framework](https://iep.utm.edu/justwar/)**, not a legal one (although it has influenced international law, and following international law is part of the ethical framework as a \"competent authority\"), which truly reveals his expertise and knowledge.**\n\n**He tried to argue with me that the Assad regime's existence was the reason why Israel didn't want to bomb Iran sooner, and after the regime collapsed, Israel wanted to bomb Iran, even though** [**Netanyahu ordered attack plans for bombing Iran in November 2024**](https://www.timesofisrael.com/liveblog_entry/netanyahu-says-he-gave-order-to-take-out-irans-nuclear-program-in-november-2024/)**, before the Assad regime collapsed, which would imply that his decision to bomb Iran was not related to the Assad regime collapsing. Instead, he kept screeching at me about how the attack was set in April, which has nothing to do with what I'm arguing about, the obvious point being made was that Netanyahu started plans to bomb Iran before the Assad regime collapsed, yet apparently he couldn't grasp that very simple argument.**\n\n**Good community here, guys!**",
    "score": 0,
    "num_comments": 155,
    "created_utc": "2025-06-27 19:53:34",
    "url": "https://www.reddit.com/r/Destiny/comments/1llvwfp/i_wrote_a_40_page_essay_describing_why_israel_was/"
  },
  {
    "id": "1lhdx6o",
    "title": "Tell NJ Leaders NO WAR WITH IRAN",
    "text": "This evening, the Trump administration undertook the unconstitutional action of directly bombing Iran's nuclear research facilities. This is an illegal and dangerous escalation that risks dragging our country into decades of war. Another Iraq, costing trillions of taxpayer dollars and hundreds of thousands, if not millions, of innocent lives. If you are old enough to remember the prelude to the Iraq War, or young enough that you fear dying in the next one, I urge you to contact our senators and your House representative and demand they sign onto War Power Resolutions currently in the House and Senate. I've also included info for the Democratic House and Senate leaders who have expressed approval for aggression against Iran.\n\n**US House of Representatives**: Bipartisan War Power Resolution introducted June 18th by Democratic Rep. Ro Khanna (CA\\_17) and Republican Thomas Massie (KY-04)\n\n**US Senate:** War Power Resultion introduced by Sen. Tim Kaine of Virginia.\n\n|Name|Recent Statements|Contact|\n|:-|:-|:-|\n|Senator Cory Booker|[Vague waffle, ultimately supporting escalation with Iran](https://www.booker.senate.gov/news/press/booker-statement-on-israels-attack-on-iran)|[Email](https://www.booker.senate.gov/contact/write-to-cory), [https://www.booker.senate.gov/contact](https://www.booker.senate.gov/contact)|\n|Senator Andy Kim|[Against escalation with Iran](https://www.kim.senate.gov/senator-andy-kim-statement-on-israels-strikes-inside-iran/)|[https://www.kim.senate.gov/contact/#share-thoughts](https://www.kim.senate.gov/contact/#share-thoughts)|\n|Rep. Robert Menendez (NJ-08)|[In support of escalation with Iran](https://menendez.house.gov/media/press-releases/menendez-statement-israels-attack-iran)|[https://menendez.house.gov/contact/offices/washington-dc-office](https://menendez.house.gov/contact/offices/washington-dc-office)|\n|Rep. Lamonica McIver (NJ-10)|None (embarrasing)|[info@LaMonicaForCongress.com](mailto:info@LaMonicaForCongress.com) 60 Park Place Suite 302 Newark, NJ  07102 Phone: (973) 645-3213|\n|House Minority Leader Hakeem Jeffries|Two statements. The first affirms that [Iran sucks and should be bombed](https://jeffries.house.gov/2025/06/20/leader-jeffries-statement-on-recent-developments-in-the-middle-east/), but that bombing should be approved by Congress. The second is [a tepid condemnation](https://jeffries.house.gov/2025/06/21/leader-jeffries-statement-on-trumps-unilateral-military-action-in-iran/) of tonight's strike on Iran.|[https://jeffries.house.gov/contact/](https://jeffries.house.gov/contact/)|\n|Senate Minority Leader Chuck Schumer|None, unless you count [this](https://x.com/SenSchumer/status/1929676991789203528) humiliating clown show|[https://www.schumer.senate.gov/contact](https://www.schumer.senate.gov/contact)|",
    "score": 36,
    "num_comments": 137,
    "created_utc": "2025-06-22 08:05:59",
    "url": "https://www.reddit.com/r/jerseycity/comments/1lhdx6o/tell_nj_leaders_no_war_with_iran/"
  },
  {
    "id": "1jt8xph",
    "title": "The United States and the Possibility of War with Iran",
    "text": "Netanyahu and the nation of Israel are giddy from the behavior of Donald Trump.  Trump, according to Israelis, has given Israel everything it has wanted and more, and Israel believes that Trump will continue in this manner.\n\nBut anyone familiar with Donald Trump and the way he thinks might look at this in another way.\n\nTrump is very concerned with how he appears.  He does not like people who are weak and he doesn't like losers and he is going to do whatever he can to keep from being seen as a loser or as weak.\n\nTrump knows the history of Netanyahu's dealings with American presidents.  \n\nWhen Clinton first met Netanyahu--when Netanyahu got up and walked out of the room after telling Clinton what he wanted, Clinton asked Vernon Jordon, \"Who is the president of the super power?\"\n\nWhenever an American president has opposed Netanyahu, Netanyahu gets on the phone and in a few hours the president is catching hell from both sides of the aisle.  Netanyahu has won every single time.\n\nTrump watched Netanyahu walk all over Biden.  He is determined that Netanyahu is not going to walk over him.\n\nTrump knows what would happen if he challenged Netanyahu now.\n\nTrump ia giving Netanyahu everything he wants now--he could be giving Netanyahu everything Netanyahu asks for now voluntarily.  We really do not know.  Trump is a schemer.  \n\nIt's not making deals that Trump likes:  Trump likes coming out on the top side of deals.  He likes winning.  You can read all about in \"The Art of the Deal\" and his other books.\n\nAnd in those books you will notice a refinement on how he approaches deals.  His personal feelings are very important.  Trump especially likes coming out on top of people he does not like.\n\nTrump despises Netanyahu.  That Jeffrey Sachs video he posted on his social truth page says it all.\n\nTrump is biding his time, waiting on an opportunity to smack Bobo down.  If the nation of Israel knew Donald Trump, they would get rid of Netanyahu and keep replacing him until they got somebody that Trump liked.  \n\n\\-The Israelis are all happy as larks at the thought of the United States going to war with Iran.  Have they forgotten what Trump said about the war in Iraq?  Trump said that going into Iraq is the stupidest thing than an American president has ever done.  And he believes that Bobo was behind that. Whether Netanyahu was behind that or not--I don't know.  What I know is that Jeffrey Sachs thinks that and Trump posted a video of Jeffrey Sachs saying that.\n\nHas everybody forgotten about how Trump talked up going to war with North Korea?  Trump believes in taking extreme positions in negotiations--and that is probably good advice.\n\nRight now Netanyahu is saying Trump has been the best president for Israel.  Trump will point that out in the future.  \n\nDonald Trump will not go to war with Iran.  Trump is letting his flunkies plan for a war, but Hegseth has said that Trump told him, \"Tell me about action you are planning to take 24 hours in advance.\"  This is not going to be like when Rumsfeld and Cheney forced Bush to go along with them.  No troops have  moved over there, have they?\n\nTrump knows he can't rely on his flunkies to come up with any war plan.  Those guys are rank amateurs and Trump knows it.  Trump picked them exactly because they are rank amateurs.  It does not matter to Trump because Trump will make all the decisions.\n\nPeople make a big deal out of the B-2s at Diego Garcia.  Our B-2s can attack any spot in the world from any spot in the world.  When they attacked Iraq they flew in from some place like Nebraska.  Those B-2s have sleeping quarters--one bed--and cooking equipment.  The stealth technology in B-2s is about 40 years old.  They used to stay in the air space of the United States 100% of the time in order to give no opportunity for anybody to test out radar frequencies on them, and they attacked from the United States and flew back to the United States.  Now I guess we know they can be detected by radar, so what does it matter if we fly some to Diego Garcia?\n\nThe United States and Iran have been talking through backchannels since at least the time that Israel attacked the Iranian embassy.  \n\nIran has said they are not building atomic bombs and that they do not intend to build atomic bombs.  We would know if Iran built a bomb just like we knew that Israel had built bombs.\n\nIf we did go into Iran, Israel would feel the destruction of war for the first time because Iran has thousands of missiles and Iran has hypersonic missiles--according to ChatGPT.\n\nChatGPT also confirmed that Israel knocked out Iran's air defenses--using JPost as it's source.  But when I asked if Israeli jets flew into Iranian airspace, ChatGPT said they did not enter Iranian airspace..\n\nEven if Israel had knocked out all of Iran's air defense--that was last October.  How long would it take Iran to get a system up and running?  It would take as long as it took Russia to deliver the S-400 system.  The S-400 system is on wheels.\n\nThe United States is not going to war with Iran.  The thing is, even if we did go to war with Iran and made Iran look like Gaza, Israel's problems wouldn't be solved.  There's still Turkey and Egypt.\n\n",
    "score": 0,
    "num_comments": 234,
    "created_utc": "2025-04-07 05:41:59",
    "url": "https://www.reddit.com/r/IsraelPalestine/comments/1jt8xph/the_united_states_and_the_possibility_of_war_with/"
  },
  {
    "id": "1lc8p4x",
    "title": "Should China not be more active in these sort of wars? (Israel v Iran)",
    "text": "With the recent Israel-Iran war I'm trying to understand China’s long-term strategy here. The US, NATO, and Israel have been actively reshaping the world military interventions, regime change, economic warfare, and building networks of vassal states and puppet leaders across the Middle East, Africa, Eastern Europe, Asia and beyond.\n\nMeanwhile, China seems to be taking a much more passive, economic-focused approach. They build infrastructure, offer loans, and talk cooperation but they don’t intervene when the West destabilizes regions, installs client governments, or ignites proxy wars.\n\nHere's my concern:\nIf this continues unchecked, won’t China eventually find itself completely surrounded? Economically strong, I guess but isolated politically and strategically, with no real allies and everyone else under Western influence or coercion.\n\nAnd if the U.S. is clearly preparing for conflict with China who's going to back China when it finds itself cornered? Yes I agree that it’s impossible to militarily conquer China but if the West has everyone on the globe as their proxies then it becomes very easy to isolate and cripple China, without a war or conflict.\n\nSo my questions:\n\nIs China playing the long game wisely, or passively watching the net tighten?\n\nShould it be more active in supporting anti-Western powers or forming counter-alliances (BRICS+, Iran, Syria, etc.)?\n\nWhat happens if everyone else has already been bought or bullied into siding with the West by the time China is forced to fight?\n\nGenuinely curious how others see this.",
    "score": 103,
    "num_comments": 111,
    "created_utc": "2025-06-16 00:25:26",
    "url": "https://www.reddit.com/r/Sino/comments/1lc8p4x/should_china_not_be_more_active_in_these_sort_of/"
  },
  {
    "id": "1ldifim",
    "title": "A collection of MLs losing It over the Communist Party of Iran's statement ragarding the war with Israel... Enjoy",
    "text": "All the social-chauvinists are now “Marxists” (don’t laugh!)",
    "score": 245,
    "num_comments": 70,
    "created_utc": "2025-06-17 14:10:42",
    "url": "https://www.reddit.com/gallery/1ldifim"
  },
  {
    "id": "1licw46",
    "title": "If the U.S. has UFO tech, why bother sending B2 bombers across the planet?",
    "text": "Something doesn’t add up.\nThe U.S. just launched a strike on Iran using B2 stealth bombers. These things had to fly across the planet, refuel multiple times in midair, and operate with a fleet of about 125 support aircraft. The whole trip took over 30 hours.\n\nNow here’s the weird part. If we believe the claims made by military insiders, whistleblowers, and even some declassified documents, the U.S. has had access to advanced propulsion systems for decades. We’re talking about craft that can defy gravity, move silently, evade all radar, and cross continents in minutes. Some people call them TR-3Bs or black triangles. Whatever the name, these vehicles are supposed to exist.\nSo why are we still sending 1990s bombers around the world with fuel tankers like it’s World War II?\nThat raises three possibilities:\n\n1. The advanced tech doesn’t exist.\n2. It exists, but it doesn’t work well enough to be used in combat.\n3. It works, but it’s so secret that they won’t risk exposing it, even during war.\n\nPersonally, I think it’s number three. These systems are probably operational but are kept so far off the books that using them would cause a political and scientific earthquake. You can’t just unveil a flying triangle over Iran without blowing the lid off the entire secrecy structure.\n\nSo what do you think?",
    "score": 2002,
    "num_comments": 1320,
    "created_utc": "2025-06-23 15:14:52",
    "url": "https://i.redd.it/5j5zfzipjn8f1.jpeg"
  },
  {
    "id": "1ldhm8h",
    "title": "Albanese’s meeting with Trump cancelled because of Iran-Israel war",
    "text": "",
    "score": 65,
    "num_comments": 118,
    "created_utc": "2025-06-17 13:14:48",
    "url": "https://www.smh.com.au/politics/federal/albanese-s-meeting-with-trump-meeting-cancelled-because-of-iran-israel-war-20250617-p5m7ym.html"
  },
  {
    "id": "1ju7dia",
    "title": "Just getting ready for the war with Iran.",
    "text": "“We are very cost conscious but the military is something that we have to build and we have to be strong because you have a lot of bad forces out there now,” Trump said at the White House during a meeting with Israel’s Prime Minister Benjamin Netanyahu.",
    "score": 247,
    "num_comments": 92,
    "created_utc": "2025-04-08 11:50:58",
    "url": "https://i.redd.it/2ja3duiz5kte1.jpeg"
  },
  {
    "id": "1leqo0y",
    "title": "Fox News host Mark Levin screams at Fox viewers and tells them to support bombing Iran: \"You’re either a patriotic American or you’re not!\"",
    "text": "https://www.mediaite.com/media/tv/mark-levin-screams-at-fox-viewers-and-tells-them-to-support-bombing-iran-youre-either-a-patriotic-american-or-youre-not/\n\n>Fox News host Mark Levin advocated for bombing Iran on Tuesday night amid escalating hostilities between that country and Israel.\n\n>Last week, Israel bombed Iranian nuclear facilities and assassinated several top military officials and nuclear scientists. Prime Minister Benjamin Netanyahu alleges that Iran is on the verge of building a nuclear weapon, a claim he has made repeatedly for the last 30 years. Iran responded with a barrage of missiles, and the two sides have been exchanging volleys since.\n\n>Trump had reportedly urged Netanyahu not to attack and allow talks between Iran and the president’s Middle East envoy to continue. After the attack, Trump expressed support for the move and has fired off a series of bellicose posts about Iran. On Monday, he cryptically warned all 10 million residents of Tehran to “immediately evacuate” the capital. The next day, he suggested he could assassinate Supreme Leader Ayatollah Ali Khamenei and also posted simply, “UNCONDITIONAL SURRENDER!” The president also appeared to suggest that the U.S. is already involved, claiming, “We now have complete and total control of the skies over Iran.”\n\n>Levin, a Fox News weekend host, joined Tuesday’s Hannity, where he tried to rally viewers behind military action on Iran. He mocked those who suggested a U.S. attack could lead to a wider war in the region or the world:\n\n>\"The Israelis are kicking their *sses left and right and the U.S. hasn’t even gotten involved directly. Yeah, so where are they? They’re nowhere! How about China? Nowhere! How about Russia? Nowhere! What happened to World War III? There is no World War III! They all sound like a bunch of Marxist Islamists. They don’t sound like patriotic Americans!\"\n\n>\"Let me be clear. This is good versus evil. You’re either a patriotic American who’s gonna get behind the president of the United States – the commander-in-chief, or you’re not!\"\n\n>Levin went on to slam Rep. Thomas Massie (R-KY), who introduced a resolution aiming to prevent the president from attacking Iran without consulting Congress.\n\n>He added: “Folks, this is black-and-white. You’re either on the side of the red, white, and blue, or you’re on the other side. It’s that simple.”",
    "score": 2799,
    "num_comments": 593,
    "created_utc": "2025-06-19 00:47:10",
    "url": "https://v.redd.it/cy9jkx79pq7f1"
  },
  {
    "id": "1la3uke",
    "title": "There needs to be protests against war with Iran",
    "text": "I am not dying for Israel ",
    "score": 233,
    "num_comments": 65,
    "created_utc": "2025-06-13 06:36:13",
    "url": "https://www.reddit.com/r/VaushV/comments/1la3uke/there_needs_to_be_protests_against_war_with_iran/"
  },
  {
    "id": "1lhp153",
    "title": "Attacking Iran’s Theocracy While Our theocracy-adjacent politicians Justify War with Bible Quotes.  Weird seeing Sam Harris on the same side as the likes of Ted Cruz",
    "text": "What’s fascinating (and disturbing) is that while Ted Cruz and others in the White House justify their loyalty to Israel using vague religious claims, people like Sam Harris, a staunch atheist and secular thinker, also defend Israel’s actions with equally unexamined zeal, just through a different lens.\n\nSam Harris doesn’t invoke the Bible or Torah, he invokes Western Enlightenment values, rationalism, and the idea that Israel is a “civilized democracy” surrounded by barbarism. He has repeatedly argued that:\n\n* Israel is “morally superior” in its conduct of war.\n* Civilian casualties in Gaza are largely Hamas’s fault.\n* Western liberals are hypocrites for criticizing Israel while ignoring other regimes.\n\nBut what makes this parallel so striking is:\n\n* Cruz uses faith to rationalize violence.\n* Harris uses reason to sanitize it.\n\nBoth ultimately erase Palestinian suffering.\n\nBoth refuse to hold Israel to international legal standards.\n\nAnd both use their platforms to morally exceptionalize one nation’s violence while demonizing the victims of another.\n\nSo whether it’s:\n\n* “The Bible says bless Israel” (Cruz),\n* or “They’re the rational democracy in a sea of madness” (Harris),\n\nthe outcome is the same: unquestioned U.S. support for Israel, religious or secular, no matter the cost.",
    "score": 72,
    "num_comments": 105,
    "created_utc": "2025-06-22 19:20:42",
    "url": "https://www.reddit.com/r/samharris/comments/1lhp153/attacking_irans_theocracy_while_our/"
  }
]